[
    {
        "selftext": "My niece Jay(10F) was the only Granddaughter when my mother died in 2020. When she died, she wanted my niece to have her porcelain doll collection which had around 6 dolls. These porcelain dolls were around when I was a child and I had memories of getting in trouble for playing with them. They were absolutely beautiful. Well, when my mother died I (29F) decided to keep ONE doll, I know it wasn’t left to me, but I felt like they meant more to me than they could to my niece. I contemplated giving it back to her when she was old enough to appreciate it. We’re from Louisiana and hurricane Laura hit … when we evacuated. I took the doll with me because I knew it was sentimental and irreplaceable. My niece, however let all of the remaining five dolls get ruined in hurricane because she let them in the house when where got ruined. My twin sister (Jays mom) thanks that it’s only fair that I give Jay the doll. I kept safe because after all it was left for her…. My argument is that if I would have gave her the doll, it would have gotten ruined with the other ones because she didn’t care enough about them to take them her with her. Fast-forward, we are now in 2025 and I have a daughter of my own. I 100 % believe if my mom would have known she was gonna have another granddaughter she would have left a doll to her. AITA? ",
        "gilded": 0,
        "title": "AITA for not giving my niece the porcelain doll my mother left for her?",
        "upvote_ratio": 0.84,
        "ups": 5318,
        "link_flair_text": "Asshole",
        "created": 1738428980.0,
        "num_comments": 2644,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifamo7/aita_for_not_giving_my_niece_the_porcelain_doll/",
        "num_crossposts": 8
    },
    {
        "selftext": "Son's birthday today. He's 5 years old. I wasnt there this morning as stay away from home some nights due to work. Even if had slept at home would have left for work before the kids woke. We have a party planned on Saturday, and will be there at dinner time tonight. I realised that my wife gave my son a present this morning. She said it was from 'us. Apparently she does this every year. I was hurt, and told her so. I thought it was selfish that she couldn't wait to share his excitement.  Her excuse is that it is unfair on him to make him wait. find that ridiculous, and believe he absolutely could wait.  I said the only reason to give it early is the selfishness of wanting to experience his joy alone without sharing it. AITA?  Edit(s): This blew up quicker than I expected (I couldn't get online for the last hour). And overwhelmingly with YTA responses, many with some unfair assumptions so I want to add some context in my defence although I think it wont change the general outcome. 1. Today is his birthday, although we have other special plans. Next week I'm taking 3 days off work, two of which are for a family trip and the third is a special day for my son. I couldn't get today off work though, and Saturday is his proper party, which I obviously will be there. I have a 1.5 hour commute each way (hence why I don't normally see him in the morning before he gets up for school), but I normally read the bedtime story when I'm home and I video call EVERY evening that I'm not home. I'm not an absentee father, and I'm not just a sperm donor. 2. My wife has bought most of the presents but not all of them. We tend to put things in gift bags not wrap them. Last year it was me that bought the main present, this year there wasn't a main present, it was mostly a few smaller ones because the family trips mentioned in (1) are really his main present. I don't expect her to do all the gift shopping and give all the ideas, I do a share of it. She does have more free time than me, and does more of the childcare than me. That's a problem of our (shared) lifechoices and not something that we can easily change. My long commute is primarily due to decisions on her part. 3. Yes, she said she does this every year, but first and second birthday are not quite the same level of concious response, and 3rd and 4th I am not sure what she gave him in the morning. As I mentioned, last year I got the 'main' present, and that was given in the evening I am definitely jealous if she is giving him presents. I definitely want to be part of the enjoyment of his birthday.  I was hurt and didn't understand why he had to receive the present when I wasn't there. Yep he's 5 years old, and every family is different. I don't remember receiving presents until the whole family was there in the evening. I thought that was normal, and assumed my wife had the same thoughts. We hadn't discussed it, and I was upset for missing out.I think if I knew, then I wouldn't have reacted that way, but it was a shock and I was upset. I still am jealous and have some feelings to work through. I don't like my work situation and commute, but I really don't see a way to resolve it (without significant financial risk that I'm not willing to take in this climate) so will have to suck up my disappointment. I called my wife selfish for getting the joy, alone without discussing it first, or without giving me the chance to join on video call. I guess I need to take the YTA verdict. Edit(again):Too many comments to respond to, and can't respond for at least a few hours so that I can spend time with my son on his birthday!",
        "gilded": 0,
        "title": "AITA for calling my wife out on giving joint birthday present without me there?",
        "upvote_ratio": 0.8,
        "ups": 2244,
        "link_flair_text": "Asshole",
        "created": 1738855348.0,
        "num_comments": 2185,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij4zzt/aita_for_calling_my_wife_out_on_giving_joint/",
        "num_crossposts": 3
    },
    {
        "selftext": "so my daughter f21 is about to start BEP chemo. she just had major surgery to take out a tumor she had and her left ovary. she is eating very poorly (take out everyday) like spaghetti pizza and coke she’ll rearly eat heathy stuff. she says “i’m eating what i can while i can because in a few weeks i don’t anymore” but i think she should be getting more heathy to prepare because it’s very intensive (ie.., nausea acid reflux etc)  she said to stop making it about me and to let her do what she wants but i’m really worried she’s not listening to the orders of the doctor in regards to healing. she is going out to the movies when she should be resting.  she said that it’s my body and to stop making it about me but i’m genuinely worried about her health. also she isn’t obese or anything i am just worried she isn’t taking her health seriously. ",
        "gilded": 0,
        "title": "AITA for telling my daughter to eat healthy before chemo?",
        "upvote_ratio": 0.8,
        "ups": 1801,
        "link_flair_text": "Asshole",
        "created": 1738622215.0,
        "num_comments": 1099,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih28x0/aita_for_telling_my_daughter_to_eat_healthy/",
        "num_crossposts": 1
    },
    {
        "selftext": "My (29F) daughter is five months old and goes to a daycare at my husband’s (32M) workplace. My mother in law also works at the same place so she has easy access to the daycare. At least once a week she goes and spends 30 minutes to an hour just playing with my daughter. This rubs me the wrong way for so many reasons. As a mom, it frustrates me that she thinks it’s okay to just drop by whenever without at least saying something or asking (I actually just found out while writing this that she tells my husband but nobody communicates it with me). As a former daycare worker, I would have hated having someone just come in and spend time with a child because now not only do they have infants to watch, but now they have to work around a fully grown woman and make sure that she isn’t taking pictures/videos of other babies as well. I think my biggest issue is honestly that some days she gets to spend more awake time with my daughter than I do and I know that’s a horrible reason to be frustrated with someone but it is what it is. Would I be the asshole if I asked her to stop visiting daycare so frequently? She comes to our house and gets to spend several hours with my daughter at least once a week so it’s not like daycare is the only time she gets to see her.   ETA: Yes. I know I’m the asshole for being jealous. After talking with my husband, I’m realizing a lot of these feelings are based on big emotions from being exhausted and PPD. I don’t hate my mother in law. This is my first and probably only child and she’s my rainbow baby so I’m very protective. For those of you that politely told me I’m the asshole, thank you. For those of you that told me I need to see a therapist, already seeing one for my chronic depression and added postpartum depression so I’m good. I’m going to stop reading comments now and go snuggle with my baby that just got home. ",
        "gilded": 0,
        "title": "WIBTA if I told my MIL she could no longer visit my child at daycare?",
        "upvote_ratio": 0.85,
        "ups": 1346,
        "link_flair_text": "Asshole",
        "created": 1738796239.0,
        "num_comments": 384,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iinj2v/wibta_if_i_told_my_mil_she_could_no_longer_visit/",
        "num_crossposts": 4
    },
    {
        "selftext": "So, a little context: I (35M) am getting married to my fiancé, Audrey (29F), in a few months. My brother, Steve (30M), has been dating his girlfriend, Lisa (28F), for about a year now. I’ve never really clicked with Lisa, but we’ve always been cordial. She’s kind of loud and opinionated. She also has a tendency to interrupt people when they’re talking, and it drives me nuts. Here’s where it gets tricky. A few weeks ago, my mom mentioned that I “really should” invite Lisa to the wedding, even though I didn’t initially plan to. I told my mom that I was keeping the guest list tight, and that it was more about the vibe of the event. I didn’t think it would be an issue since Lisa and I aren’t close. But my mom started pushing, saying that if I didn’t invite Lisa, it would be “super awkward” for Steve and that “family is important.” I still didn’t budge, and my mom seemed to accept it. However, I was talking to Steve yesterday, and he brought up the wedding. He casually mentioned that Lisa was upset she wasn’t invited, and that it was “weird” that she was left out when she’s been dating him for a year. He said that it would mean a lot to him if I reconsidered. I told him I didn’t want to cause drama, but I just didn’t feel comfortable inviting someone I don’t get along with to my wedding. He got kind of quiet and then said, “I guess I’ll just skip the wedding, then,” and walked off. Now, I’m feeling conflicted. I don’t want to lose my brother over this, but I also don’t think it’s my responsibility to make space for someone who isn’t really part of my life, especially on such a personal day.",
        "gilded": 0,
        "title": "AITA for not inviting my brother’s girlfriend to my wedding?",
        "upvote_ratio": 0.81,
        "ups": 508,
        "link_flair_text": "Asshole",
        "created": 1738475716.0,
        "num_comments": 655,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifqmrb/aita_for_not_inviting_my_brothers_girlfriend_to/",
        "num_crossposts": 1
    },
    {
        "selftext": "My 18yo daughter lives at home - as she should since she is not at college or working in a full time job. She graduated high school in 2024 and has a part time job.  She does not drive. My husband and I drive her to work, to her community activities, to hang out with friends, and to dates. She recently asked if she could have 5 people over for her birthday and for a sleepover. We said no. We told our kids that parties are fine through their 18th birthday and for graduation but after that we only have family celebrations. Our reasons: It's a small place and we'd be on top of each other.  After working our jobs all week and juggling her and her brother's activities, we need some calm and quiet. Also, we don't know these kids.  Having them over for a couple of hours is something I can gear myself up for, but an open-ended time of strangers in my space... my heart is racing as I'm typing this.  It makes me super anxious. Daughter knows this (about the anxiety) but has been arguing that it's not a big deal, everyone else does it, and I never have people over.  She has had people over from time to time, but since she and her friends are all dependent on rides, it doesn't happen often. I floated the idea of a 2-3 hour hangout but since she argued with us for about 20 minutes, my husband is like 'nope. not gonna happen. I understand that she's disappointed and wants to hang out with her friends for her birthday. So, reddit, would I be the asshole for not hosting a party for my daughter's 19th birthday? UPDATE 9:55 pm. Some thought provoking questions in the comments. No sleepovers ever? Yes, from around 2nd grade to age 16 we hosted a couple every year - except during Covid, of course.  She hasn't been interested for a few years.  Why doesn't she drive? Lost her driver's license after causing 2 accidents in 3 months.  Thankfully, only damage from the accidents was to the cars; all people involved were fine. However, insurance dropped her and threatened to drop us if she didn't surrender her license. How are you  trying to help her? I've been trying to get her to try for her driver's license again but I'm meeting with resistance.  Talked about the pros and cons of several career opportunities but she doesn't want to have anything to do with it.  Going to counseling, but she seems to use it as a vent session - which can be helpful! - rather than taking the homework and following through with the counselor's advice. Honestly, I know that I need to step up here and take the lead.  Humans tend to do a much or as little as is expected of them; I need to help her raise her expectations. Why isn't she in college? She's not interested in post secondary education right now. She may go back later, and I'm fine with that.  Why doesn't she have a full time job? She doesn't know what she wants to do.  She's currently refusing to look for a full time and I'm not willing to kick her out.  I know a lot of folks do that to their kid when they become an adult, but I don't want to.  I love her and like having her around, knowing she's safe.  Honestly, as a parent I am struggling with how to help her without pushing her away.  ",
        "gilded": 0,
        "title": "AITA for not allowing my daughter to have a party in our home for her 19th birthday?",
        "upvote_ratio": 0.78,
        "ups": 456,
        "link_flair_text": "Asshole",
        "created": 1738546779.0,
        "num_comments": 529,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igdogx/aita_for_not_allowing_my_daughter_to_have_a_party/",
        "num_crossposts": 2
    },
    {
        "selftext": "My husband (33M) and I (31F) have been married for almost 9 years. We’ve had a lot of ups and downs, we’ve got 3 kids and he has never put in a lot of effort for my birthday (or any other holiday, for that matter). But we’ve worked through a lot this past year and I know he is trying to put in more effort. He told me recently that he was going to pay someone to come deep clean our house as my birthday present. To be fair, I have said many times that I would love to have this done but it isn’t something we need to be spending money on right now so we haven’t done it.  He followed this up by saying that if I didn’t want to spend the money, he would gladly just take the whole day and do it himself. When he told me this, I wanted to be very mindful of my reaction. Again, he has not been in the habit of gift giving or being super thoughtful when it comes to special occasions. I told him that I really appreciated the thought and saw the effort that would take for him to do but if he took the entire day to clean the house, I would obviously just be watching my kids and trying to keep them from coming behind him and messing all of his hard work up and ultimately that doesn’t sound like a present. I felt guilty because I want to praise his effort but I also feel like this “gift” doesn’t feel personal or thought out well, despite the effort. He didn’t seem too upset by my reaction but now I’m afraid he isn’t going to do anything? I’m also feeling a bit frustrated because if the roles were reversed, I would (and have) set something up where he would be able to go do something he loved with his friends and not have to worry about me or his kids. AITA for not just letting him do this for me? ",
        "gilded": 0,
        "title": "AITA for rejecting my husband’s birthday present?",
        "upvote_ratio": 0.86,
        "ups": 580,
        "link_flair_text": "Asshole",
        "created": 1738334479.0,
        "num_comments": 330,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ieg9fs/aita_for_rejecting_my_husbands_birthday_present/",
        "num_crossposts": 2
    },
    {
        "selftext": "Me (32F) and my bf (30M) have been together for nearly 4 years now. Since a couple of months he keeps asking me to turn of the alarm of his phone in the morning. First he asked me only a couple of random days, but now it is almost dayly. He deliberately puts his phone quite far away from our bed, so he has to get up to turn off the alarm. Now I have to get out of bed to turn it off, and I HATE it... Like I don't even know how to describe how much it annoys and irritates me... I am not a morning person, and he knows this, and I have my own morning routine as to make sure I am not grumpy towards everyone in the morning. But turning off his alarm messes up my routine and makes me really frustrated in the morning. Even more so when he asks me to turn off his alarm on my day off. My bf has his own company and prefers to be early at his office. So his alarm is usually set about 40 minutes before my alarm. But sometimes it is also set 10 minutes before my alarm goes off. He will ask me to 'please turn it off one more time' and then stay in bed till my alarm goes. Now this is where I might be the AH, because the extra time in bed he mostly spends cuddling me and I really love it. Before this all started he used to turn off his alarm himself and come back to bed to cuddle, but that doesn't happen anymore.  WIBTA if I told him to either turn off his own alarm from now on, or just not set an alarm and get up when my alarm goes off?",
        "gilded": 0,
        "title": "WIBTA if I asked my bf to turn off his own alarm?",
        "upvote_ratio": 0.92,
        "ups": 784,
        "link_flair_text": "Asshole",
        "created": 1738655355.0,
        "num_comments": 209,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihcmpa/wibta_if_i_asked_my_bf_to_turn_off_his_own_alarm/",
        "num_crossposts": 1
    },
    {
        "selftext": "My wife, Emma, and I have a 16-year-old dog named Sky who was recently diagnosed with an aggressive, fast-growing form of cancer. The kind that can’t be cut out easily.  Given this, Sky’s age, and other health issues, the vet didn't recommend treatment. Instead, he's got some pain medication to help keep him comfortable, and we were told to keep an eye on the cancerous lump on his chest.  That lump has gone from pea-sized to the size of a large grapefruit in under two months. Sky’s incontinence is more frequent, and his back legs now give out regularly. He doesn't enjoy playing in the yard or chasing a ball and has become fussier about what he eats. He's also sleeping more—up to 22 hours a day. The vet has said as the growth gets bigger, it's more likely to rupture, which would require urgent veterinary care. At that point, it's likely that Sky would need to be euthanized. It's possible that this could happen outside of our vet's usual hours, which would mean we'd need to take him to the emergency animal hospital. Given all of this, I've tried talking with Emma several times about whether it is still in Sky's best interests to continue on. I think the time has come to have him euthanized. This would allow us to ensure that his passing was as gentle as possible, in a place that is familiar and without the added stress of a medical emergency. The vet has said it's up to us, and he'd support whatever decision we made. Emma thinks that we shouldn't put him down just because things have become harder for us. He does still wag his tail when he sees us and enjoys scratches, but the vet has said that dogs can be really good at hiding when they're in pain, and I think that's what's happening here. Emma doesn't see it that way and thinks that because he's not overtly suffering, we should let him live out whatever life he has left. Also relevant: I work from home, so I'm the one at home with him every day. We've discussed what I should do if something happens and she's away for work. She's told me I should do what needs to be done even if I can't get hold of her or she can't get there. It seems she's accepted that he's close to the end of his life but maybe doesn't want to have to be the one to make the decision to end it? Yesterday, I had a sudden thought that I should just tell Emma that something happened during a time when she's not available and take him to the vet myself. It shook me that I'd thought of it, to be honest. Our relationship is built on a strong foundation of trust, and I know that if I were to do something like this and she found out, there would be no coming back from that. Our 20-year relationship would be over. However, I can't stop thinking about how it could be the best thing for Sky. So, I thought I'd ask the internet: would I be the a-hole if I had my wife's dog put down and lied to her about why? UPDATE: Thank you to everyone who has taken the time to share their stories. I really appreciate all the comments (yes, I’ve read them all) and I’m going to take the advice to continue talking with Emma about what’s best for Sky. Hopefully, I can help her realize that it’s time for us to say goodbye but if not, I’ll continue to support them both as best I can through this difficult process. ",
        "gilded": 0,
        "title": "WIBTA if I had my wife’s dog put down?",
        "upvote_ratio": 0.82,
        "ups": 151,
        "link_flair_text": "Asshole",
        "created": 1738644894.0,
        "num_comments": 455,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih9zms/wibta_if_i_had_my_wifes_dog_put_down/",
        "num_crossposts": 1
    },
    {
        "selftext": "I m(32) was sent to the shopping centre on the way home from work to get lasagne sheets for my wife f(35). I went to the pasta aisle and took a look at the lasagne sheets on offer and found one box that stated “no pre cooking required” so I assumed that would be a great option and got it. Today while driving to lunch my wife said to me that she didn’t mean this as an attack but that she had told me to get fresh lasagne sheets, which are the soft ones in the cold aisle. I told her I didn’t hear her say fresh when she asked me or I would have probably figured out she meant cold. I then asked her what the difference was and why it mattered. She said that the fresh ones cook quicker.I responded that it does say no pre cooking required on the box, assuming maybe this was a newer technology and so it wouldn’t be as long.She said that didn’t matter. I then asked if she had used the no pre cooking required before and compared the cooking times to the fresh ones, since we don’t make lasagne much (I can recall one time in our 7 years together) and I wouldn’t think she would have used these before and was making assumptions. She then started to get angry and said that we always get the fresh ones and if she says she w at the fresh ones then that should be it and she shouldn’t have to justify why she wants them, if she says to get them then just get them. I argued that I always like to educate myself and will clarify and ask questions rather than ever just go ahead and do what you’re told, that isn’t who I am and I should be able to ask questions and clarify. At no point did I say I wouldn’t get the fresh ones in the future or that I was right to get the no pre cook ones, I’m just trying to make sure I understand what the difference is and that she has also considered the differences. She then said that the way I was saying it was defensive and right fighting and that she felt I wasn’t listening to her because I was asking all these questions rather than just saying “yes dear”.I continued to explain that I was just trying to understand and clarify, I wasn’t defending that I was right to get those sheets or that I wouldn’t get the fresh ones in the future but she said it didn’t matter because of the way it was making her feel.She wasn’t able to clarify what about my tone or words or mannerisms was making her feel that way rather than just feeling like I’m trying to understand. So I don’t know how to avoid this in the future but not just end up as a mindless “yes dear” robot. Am I the asshole because I tried to understand why she wanted fresh sheets instead of just noting to get fresh sheets next time?",
        "gilded": 0,
        "title": "AITA Trying to understand lasagne sheets.",
        "upvote_ratio": 0.36,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738811067.0,
        "num_comments": 321,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iispko/aita_trying_to_understand_lasagne_sheets/",
        "num_crossposts": 2
    },
    {
        "selftext": "I [19F] currently live with my Mum [52F] and 3 sisters [15F, 21F, 31F], but my Mum has made plans to move overseas in the next 6 months with my 3 sisters. She has wanted to move for years as the cost of living in our country is horrible, and she ‘has nothing left here’ (her parents passed away 2 years ago, and she is single).  I was originally going to stay here and rent the current place we live in with my older sister [31],, and my BF [20], but my older sister has since decided that she wants to move with my mother, and that leaves me being unable to afford to live in our current house. I don’t wish to leave as I have my whole life here; I just started UNI, my boyfriend and friends live here and my dog ‘wouldn’t make the trip’. I am unable to work currently as I am chronically ill and am unsure of how my body would react to both full-time study and work. I get government assistance of $210/Weekly which will be unable to cover rent for anywhere but a single room in a share house but I won't be able to bring my dog. I am left in a position where I would have to financially rely on my BF more than I would like to and would be homeless if we ever broke up. I have brought these issues up to my mom and asked her for a bit more time until I qualify for student housing and can find a nice family to take my dog. However, everyone keeps saying that I am ruining this for her and that I should move overseas with them. She has dreamed of moving for years and is now ‘able’ to, but especially since her health is degrading, she is losing time to move. Should I give in and leave everything behind or do I stand my ground? EDIT:  Just want to clarify some things. - My relationship isn't new, its 2 years old.  - My dog isn't dying or old, she is just an anxious dog.  - My mom isn't actively dying, she is just getting old and has pre-existing health conditions.  - Yes, I could move to this new country but I would loose the specific program I got into that they do not offer there as well as my scholarship which would put me through Uni.  - I am currently applying to get more government assistance but it would only go into effect after she leaves  - I haven't had a job as my mother advised me not to and originally told me that she would financially support me through schooling  - pet friendly rentals are rare in Australia  - I cannot stay in my current house as the landlord doesn't want a first-time renter staying here.  - My family do not have anything lined up for them in the new place, no jobs, no education, no housing.   - I asked for them to postpone the move until the end of the year so that I can apply for student housing and rehome my dog    ",
        "gilded": 0,
        "title": "AITA for ruining my mothers dream to move overseas?",
        "upvote_ratio": 0.76,
        "ups": 99,
        "link_flair_text": "Asshole",
        "created": 1738650856.0,
        "num_comments": 177,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihblmt/aita_for_ruining_my_mothers_dream_to_move_overseas/",
        "num_crossposts": 2
    },
    {
        "selftext": "My partner and I live with her mom. She is very gracious in allowing us to live there so we can save money and buy a house. There is however, one complication. We have two cats, and when we moved in we asked that she gets rid of the toxic plants (she had a lot of lillies). Since we moved in two months ago, she has twice brought lillies home. Both times, we just said hey these are lillies can we move them, and she has no problem with that. Another time, she brought home a plant that was toxic, but I can't remember the name and it was shortly after she brought lillies home for the second time. A few days ago, she brought home a new plant that her friend gave her. I assumed that she had already checked the plant to see if it were toxic or not. Today, I looked it up myself and sure enough, its toxic to cats. When I approached her about the plant, I was respectful and just asked something like could you please check to see if the plants are toxic before you bring them in. Her response was saying that she felt attacked, that she didn't do anything wrong, and that because I helped unload her car, I should have seen the plant and looked it up then. (I didn't unload the plant from the car, just her heavy groceries from the trunk). We ended up getting in a heated argument. She was adamant that she did nothing wrong and that its my responsibility to look up the plants she brings in. I don't necessarily disagree, they are my cats and it is my responsibility...and I do look up all the plants she brings in. But after today being the third or fourth time she brought a toxic plant in...I just felt its not unreasonable to ask if she could look it up before hand. AITA? She does have obsessive personality disorder, so maybe her behavior has something to do with that? Or, maybe I'm just an asshole. Edit:  I should make it clear that’s she is not a plant person. She only has like two plants in her house at any given time. She has one on the kitchen window sill( the one her friend gave her), and a bouquet of flowers on the kitchen island. She usually only has the flowers and changes them once a month",
        "gilded": 0,
        "title": "AITA for asking my MIT to check if plants are toxic to cats?",
        "upvote_ratio": 0.62,
        "ups": 34,
        "link_flair_text": "Asshole",
        "created": 1738454164.0,
        "num_comments": 178,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifk2ni/aita_for_asking_my_mit_to_check_if_plants_are/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (23F) have a friend (24F) who is currently in uni in another country. Her family is pretty strict so being far away from them made her go a little wild. Recently she was ranting to me about how her first kiss experience. She and her uni friends went clubbing, where she drank heavily and got drunk, but not drunk enough to fully black out, being still lucid enough to be aware of her surroundings and actions. According to her, this guy started approaching her, and they ended up grinding and eventually the guy kissed her, and it escalated into a full make out session.  The next morning she immediately regretted letting the guy do that to her and she called me for support.  While she described the story, it seemed like she wanted me to reassure her that the kiss didn’t count or to sympathize with her. However, I found it hard to comfort her, or for sorry for what she experienced,  because firstly she knew her friends that went with her were going to be drinking heavily as well so there’s no one looking out for her and she’s going to be on her own. Secondly, she consented to the guy kissing her at that point (not saying no/pushing him/walking away) and also she kissed him back which was what caused the kiss to become a full make out session.  I knew she could’ve done something because after the kiss happened the grinding continued and she began feeling uncomfortable about the guy starting to touch her inappropriately and so she walked away right away so it’s not like she couldn’t have done anything if she did not want him to kiss her. She just regretted giving away her first kiss to a total stranger who she doesn’t even remember.  I didn’t say much on the call and didn’t offer the reassurance she seemed to be seeking. I felt conflicted because I think she willingly engaged in the situation and only regretted it afterward. However, I wonder if I was wrong for not being more supportive as her friend. I might be victim blaming as well for thinking that she should’ve been more careful and responsible about her alcohol intake, knowing that she has no one watching out for her.  AITA? EDIT: I did not say much on the call as I was in complete shock that this happened to her. I was in no way judging her and I feel really bad that her first kiss (which is something she was looking forward to) was taken away like this. I am just wondering if I am the AH for not showing her the support that she wanted me to ie telling her it doesn’t count as her first kiss. I did not tell her off or voice any of my “judgemental” opinions I just listened.  EDIT 2: My friend asked me and I quote “It doesn’t count right” as to whether this is her first kiss experience or not I am not assuming anything.  ",
        "gilded": 0,
        "title": "AITA for not comforting and possibly victim blaming my friend after she regretted her first kiss at a club?",
        "upvote_ratio": 0.51,
        "ups": 1,
        "link_flair_text": "Asshole",
        "created": 1738669319.0,
        "num_comments": 179,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihfroo/aita_for_not_comforting_and_possibly_victim/",
        "num_crossposts": 2
    },
    {
        "selftext": "I'm a mother of a 17 year old daughter who is a current senior in high school. She's been putting off getting a job for a few weeks (she's applied to six over the past three weeks with no response) so my husband and I decided to put our feet down. We gave her until 8:00 PM to draft us a multi-week plan regarding how she plans to get a job (e.g. how many jobs a week? which jobs? etc.) She gave us a half-assed paper that said, apply to 3 jobs a week. We told her that this was unacceptable, and told her that she wasn't even really trying to get a job. She then asked us aggressively how many jobs *we* thought she should apply to, and I said that she should apply to 3 a day. My daughter then said, well then how am I supposed to devise a multi week plan if I'm already going to be applying to 21 jobs a week? We said that it's still a multi-week plan, consisting of applying to a total of 42 jobs over two weeks. She got very upset at us and cried and yelled, and locked herself in her bathroom for the rest of the night. It was also her job to do dishes today, and we reminded her with a text about this, to which she refused to do them. We didn't know what to do, and are threatening her with not letting her go to her friends debutante ball and winter formal after party.  I just want her to learn to be independent and prepared with some funds before she heads off to college: Am I the asshole?",
        "gilded": 0,
        "title": "AITA for making my daughter apply to 42 jobs?",
        "upvote_ratio": 0.31,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738566825.0,
        "num_comments": 142,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igjjbg/aita_for_making_my_daughter_apply_to_42_jobs/",
        "num_crossposts": 1
    },
    {
        "selftext": "Ok so I’m really pissed off and disappointed at my bf of 10 years. On Thursday he had to fly from Canada to Jamaica for his grandpas funeral. He invited me to go but decided he wasn’t going to bring me anymore, I was upset he didn’t end up bringing me because he decided to fly with his brothers instead so whatever I had to just deal with it. We have never went on a trip outside of the country without each other so that’s why it was disappointing. I even packed his suitcase and helped him convert money to Jamaican dollars and literally helped him with booking the ticket, even though again I was mad I still did it for him. He specifically told me he’s not going down there for fun, said he’s only there for the funeral and to mourn the death of his grandpa. Tell me why I check his location and he’s at a fucking resort the day AFTER the funeral which is 4 hours away from his grandpas house? When I asked him he told me it’s not a resort, he’s at a hotel. LIES! I google it and it’s a resort in negril, with a nice beach, pools, buffet, LOUD music. Who is he trying to fool? And yes that made me upset because again, he’s there without me and I know he would be upset too if I did the same thing. And LIED about it. AGAIN, I was forced to get over it. So this is the cherry on top of why I’m angry. Before he left to Jamaica, I sent him $200 Canadian dollars to cover what I asked for which was roasted breadfruit, which is hard to find here where I live. I specifically asked for 6 of them which cost less than $5 Canadian dollars. That’s all I asked for. The only reason I asked for that was because I know his mom brings down so much food, she brings more than 6 roasted breadfruits, fruit, a lot of raw fish and bottles of wine and beer. So I know she had no issues going through customs. Tell me why he calls me today, I asked him what he bought me and all he bought me was 1 FUCKING BREADFRUIT. Mind you, I ASKED him and PAID for it so he can make it up to me by him excluding me on the trip. He told me he’s going to have issues with customs and then called me ungrateful. I told him I only fucking asked for that and he didn’t even try to make me happy considering how he excluded me and went to a fucking resort without me and tried to lie about it. Do I even have the right to be angry?? I told him he can keep it for himself and asked for my money back. AITA?Ps the reason I’m so upset is because I have the biggest heart and do so much for him and spoil him and he doesn’t even fucking try to reciprocate it back, I’m not asking for the exact same but at least try. And he fucking didn’t. ",
        "gilded": 0,
        "title": "AITA for not being grateful for the stuff my bf bought me from Jamaica?",
        "upvote_ratio": 0.4,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738613771.0,
        "num_comments": 137,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igyroj/aita_for_not_being_grateful_for_the_stuff_my_bf/",
        "num_crossposts": 1
    },
    {
        "selftext": "An internet mutual and I had the idea to apply to artist alley tables at conventions together, because it's easier to take care of a table with two people (if one has to pee, the other can babysit the artwork).  He has experience as a vendor at Cons and I do not. So I thought he could be my guide and help me navigate all that stuff. I also thought that our chances of actually getting a table would be better because he already had that experience.  We've applied at the end of last year and by now we have been rejected by every single convention we have applied to. With one exception. One convention didn't allow shared tables so we applied separately and then planned to ask the Con to put our tables next to each other if both of us got accepted.   Well, he got a rejection and I was accepted. It's by far the biggest Convention we applied to with the most competition for the tables. And it is his Dream Convention he always wanted to vend at.  The two of us had found 3 more Conventions we'd like to try for before I got that accepted to the big Con. But since I got that acceptance letter I am thinking that I might have better chances of getting in if I apply alone.  I knew from the get go that the products he made were of lower quality than mine but I thought his vending experience would be more important to Cons than the quality of his things (turns out, most Cons don't even ask if you have prior experience and just look at the products).  Why I would be the asshole: Breaking a promise is bad and he has talked multiple times about how he just isn't good enough and about how sad he is about all the rejections. I don't want to add insult to injury.  Why I wouldn't be the asshole: It turns out that his vending experience is limited to small Conventions. It seems like in most cases he was accepted, because all applicants were accepted. I didn't know about this before we decided to share a table. I don't think he intentionally mislead me but I would have made a different decision if I had known.   And for him art is a hobby, for me it's my job. The stakes are higher for me because my income depends on it.  Would I be the asshole if I break the promise I made to apply together and tell him that I want to apply alone?    ",
        "gilded": 0,
        "title": "WIBTA if I tell another artist I don't want to apply to artist alleys at conventions with him anymore, because I feel like I have better chances alone?",
        "upvote_ratio": 0.96,
        "ups": 189,
        "link_flair_text": "Asshole",
        "created": 1738876639.0,
        "num_comments": 67,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijdpkr/wibta_if_i_tell_another_artist_i_dont_want_to/",
        "num_crossposts": 1
    },
    {
        "selftext": "  AITA for refusing to tell my friend where I got my bag? So, this might sound silly, but it’s been bothering me, and I need some outside opinions. I (let’s say 25M) recently bought a new bag. It’s a really nice bag—well-designed, stylish, and super affordable compared to the market price. I love it, and I think I got a great deal. A few days ago, my friend (also 25M) saw me with the bag and complimented it, asking where I got it. I just laughed and said, “It’s a secret.” He jokingly replied, “Did you get it off the black market or something?” I shrugged it off but told him, “Do I look like someone who buys from the black market?” He seemed to notice the convo was going nowhere, so he changed the subject. The next day, he brought it up again, saying he wanted a similar bag but in a different style and asked where he could find one. At that point, I told him, “Since you’re persistent, I’ll guide you to somewhere you might find something similar, but I really don’t like sharing my sources—so don’t ask why. I have my reasons.” Now, here’s the thing—this friend has always been supportive of me and has dedicated a lot of energy and time to help me in life. But I just don’t like sharing where I buy my things. It’s just a personal thing. He seemed kind of annoyed but didn’t push further. Now I’m wondering, AITA for refusing to tell him where I got my bag? ",
        "gilded": 0,
        "title": "AITA: I hate sharing where I got my things from",
        "upvote_ratio": 0.22,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738492211.0,
        "num_comments": 126,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifuhzq/aita_i_hate_sharing_where_i_got_my_things_from/",
        "num_crossposts": 2
    },
    {
        "selftext": "Last weekend, I had to fly out of town for my brother’s funeral. He was a secret alcoholic and I hadn’t seen him in 5 years. It was a rough trip. They had the idea that he would really like it if we went to an arcade bar and they kept buying drinks. I ended up having 5 voodoo rangers. The whole thing was weird. Because of the flight time and the location we ended up just staying the night at the airport. It was rough. Since I had no one else to help, I asked my best friend (let’s call him Adam) and his girlfriend (let’s call her Sue) to let my puppy out while I was gone.I was only supposed to be gone from Friday at 5 to Sunday at 3pm.  His parents (Mark and Lisa) also helped out. I called Adam and told him the instructions to take care of the pets, but I didn’t leave a written list, which I now realize might have been a mistake. The original plan was for them to take him over to their house since he’s about 3 months old. But Adam  didn’t communicate that with his dad. And then the vet told us he had roundworm so that made it not possible for them because Mark  and Lisa’s dog is old and they didn’t want to risk it. When I got back, the first thing I noticed was that my puppy was in the wrong crate, he was covered in pee, and had chewed up the bed in that crate. So clearly, things weren’t followed how I had asked. That already frustrated me on top of being hungover and exhausted and grieving. But I was too exhausted to deal with it at the time. My wife sent a thank-you text to Mark and Lisa but accidentally left out Adam and Sue. A little while later, Mark called me, asking about it and then straight-up asked if I was mad. The truth is, I was. because they didn’t really do what I had asked. But instead of apologizing or acknowledging anything, Adam immediately shifted blame, saying it was my fault for not explaining things well enough, and got very pissed about me not saying thank you. Then Sue said I was being passive aggressive. Instead of saying something back I just told her that I’d like to keep it between me and Adam because I originally asked him. I did shut her down but I didn’t want her to get caught in the middle. That pissed her off royally though. Now, mutual friends are telling me I should smooth things over because Adam feels unappreciated and Sue feels disrespected. I do appreciate that they helped, but their reaction made me feel like they weren’t being very understanding of what I had just gone through. AITA for not thanking them right away and for feeling put off by how they handled this? UPDATE: So I was going to Clarify on a couple things. 1. There was no neglect and that wasn't the point of the argument 2. I know I was frustrated over minor things. I would have never brought it up if it weren't for mark calling me and asking about it and pushed for an answer. 2. The reason my wife texted was because i was driving home and I fully intended on calling him personally to thank him and even joke around about my frustrations. I gave context in my post as to why I wanted to wait 3. I am appreciative of their help and I told them that when we were arguing, It did come off as not genuine. The whole thing got a lot bigger than I think needed to be and I didn't understand why. 4. I went ahead and talked to everyone and apologized for being frustrated and letting that overshadow my appreciation. Adam is still insisting that I should have just said thank you and bent the knee. The whole interaction I think is silly, but not worth being mad about. Puppies are a handful and he did a pretty good job all things considered.  5. Finally, some of y'all are out there. This was clearly a minor case of who the butthole is and coming at me saying I drank too much or that my wife carries the emotional burden is not needed. I definitely wasn't acting in the best way but I think a little grace is merited. I would really hesitate to wanna be friends with people who would kick you while your down. ",
        "gilded": 0,
        "title": "AITA for not thanking my friends right away after they watched my puppy?",
        "upvote_ratio": 0.6,
        "ups": 25,
        "link_flair_text": "Asshole",
        "created": 1738885152.0,
        "num_comments": 109,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijh1pt/aita_for_not_thanking_my_friends_right_away_after/",
        "num_crossposts": 1
    },
    {
        "selftext": "I rent two rooms in my house to two roommates. They’re both lovely people. One of them I get on with very easily. The other is quite messy and often leaves her laundry in the machine for long periods (I’ve put it around myself again and hung it up for her most times), and doesn’t help with house chores etc. She has friends over without giving any heads up. They just turn up - I’m in my living room relaxing and I see a reverse light pulling into the drive and four people come into the house to be loud and leave a lot of spills I then clean up the following day. Once this happened when I was ill and I was settling in for a quiet evening. It’s totally fine to have friends over whenever, I always give a heads up to my housemates when I’m going to have guests.  Is it unreasonable to want a heads up when people are coming - even if you forget to, say, give a day’s notice, maybe just message when they’re on their way? That way, eg if I’m ill, I can mentally prepare and go to another room so I don’t need to talk to anyone, and I can anticipate the extra chores that will be needed afterwards. ",
        "gilded": 0,
        "title": "AITA for wanting my housemate to say when she’s planning to have people over?",
        "upvote_ratio": 0.91,
        "ups": 146,
        "link_flair_text": "Asshole",
        "created": 1738795600.0,
        "num_comments": 71,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iina36/aita_for_wanting_my_housemate_to_say_when_shes/",
        "num_crossposts": 1
    },
    {
        "selftext": "Throwaway account for obvious reasons I (F30) got married a few years ago, and for my wedding, I gave my sister, **Victoria** (F28), enough tickets to invite whomever she wanted no questions asked. The only condition was that she not invite one specific person my fiance really disliked. She understood, and it wasn’t an issue since, although they were friends, she respected our wishes. Now, Victoria is getting married. Weddings in our culture are a *big* deal, huge family gatherings filled with food, music, and dancing, where extended relatives, family friends, and even distant acquaintances are often invited. It’s not uncommon to have hundreds of guests, and the celebration is as much about community as it is about the couple. Victoria hasn’t really asked me for input on the guest list, which I understand, she already knows who she wants there. The wedding is still 9 months away, and I’ve only asked her to invite **one** person. Just one. That person is **Alice**, who is incredibly important to me, like a sister. I’ve known her since i was 10, and she even invited Victoria to her own wedding. However, when I brought it up, Victoria told me she hadn’t invited Alice and wasn’t planning to, not because she dislikes her, but because she’s already over her guest limit. She told me to “wait and see” if there’s space later. Her reasoning is that she hasn’t seen Alice in years and that Alice doesn’t know her fiance, so she’s not on the priority list. But what frustrates me even more is that Victoria keeps saying that it shouldn’t matter because she has already invited some of my friends. While that is *partially* true, the reality is that those friends are also *her* friends, she invited them because she wanted them there, not because I asked her to. I even pointed this out and said, “Well, if that’s the case, then how about we swap out a third friend for Alice?” Her immediate response was *no,* because that person is “her guest” and is definitely coming. I know it’s not my wedding, it’s Victoria’s and her fiance’s decision who they invite. I completely respect that. I’m not angry or trying to demand anything, I just can’t help but feel a little disappointed. With so many people being invite, it stings that Alice, who is like family to me, couldn’t be included. Especially when I made accommodations for Victoria at my own wedding **AITA for insisting she make room for Alice?** EDIT: Since people keep saying. Alice has been a close family friend for 20 years. She and Vic even hung out without me many times so they are not randoms. EDIT 2: Maybe using insist was the incorrect term since everyone keeps pointing that out. We only had 1 conversation about this where I said Id like to have Alice in the guest list and she said no, then we talked about it for 5 more minutes before it ended and I asked her to let me know if she changed her mind. Edit 3: I should have mentioned that we are NOT American. In our culture its very normal that parents and siblings get to invite their friends to the wedding and you are usually sat with your guests during the banquet so its not that weird that I asked about a specific friend. ",
        "gilded": 0,
        "title": "AITA for insisting my sister invite one specific person to her wedding?",
        "upvote_ratio": 0.52,
        "ups": 7,
        "link_flair_text": "Asshole",
        "created": 1738514241.0,
        "num_comments": 117,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ig1792/aita_for_insisting_my_sister_invite_one_specific/",
        "num_crossposts": 1
    },
    {
        "selftext": "I have two daughters in their 30s. One, Stephanie, is pregnant with her first child and is having a baby shower in a few weeks. I'm helping plan and pay for the shower. The other, Hannah, has a 4 y.o., Mikey. The baby shower is no kids but since I'm helping with planning and Mikey is family, I told Hannah she could bring Mikey. When I told Stephanie that Mikey was coming, she didn't say anything to me, but later called Hannah and asked if Hannah could find another option for Mikey. Stephanie said it's ok if he has to come but it's not a party for kids.  Hannah called me very upset that her son isn't wanted at the party, so I called Stephanie and told her she's being rude, needs to respect her family more, needs to apologize to Hannah, and should be happy Mikey is coming. She told me that this was between her and Hannah and that I should stay out of it. I said that I'm planning the party, so I don't have to stay out of it (I stayed out of it when Stephanie didn't invite all of her aunts/uncles to her wedding but I'm not staying out of this). She replied that she'd plan the party herself and uninvited me.  I'm just trying to help my daughters resolve their fight and plan a nice party. AITA?",
        "gilded": 0,
        "title": "AITA for helping out my daughters?",
        "upvote_ratio": 0.41,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738541706.0,
        "num_comments": 104,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igbyhp/aita_for_helping_out_my_daughters/",
        "num_crossposts": 1
    },
    {
        "selftext": "My wife (F27) wants to get a disco ball tattoo. I (M31) think it’s pointless. Background: she has 8 other tattoos, most with significant meanings (e.g. the birth month flower of her friend who passed away). I’m all for tattoos, I find them generally attractive and expressive, even though I don’t have any. But in this situation, I think she’s being impulsive. She saw a “walk in flash sale for Valentine’s Day.” I told her it’s her body so obviously she should ultimately do what she wants but I’m trying to be the voice of reason here. SHE DOESNT EVEN LIKE DISCO (Random!) 😂 tldr; AITA for acting disappointed if my wife gets a random tattoo",
        "gilded": 0,
        "title": "AITA for telling my wife she shouldn’t get a tattoo",
        "upvote_ratio": 0.45,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738634565.0,
        "num_comments": 96,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih6qy7/aita_for_telling_my_wife_she_shouldnt_get_a_tattoo/",
        "num_crossposts": 1
    },
    {
        "selftext": "My BIL (28M) used to live with his parents, paying £30 a week for rent and food. About 18 months ago, he started spending more time at our place after his parents’ dog turned on him. I offered him to move in with us so he could save enough to move out. My husband wasn’t thrilled about the idea, but I thought it would only be for a few months. EDIT we made the decision together, i didn't go against my husband's wishes we didn’t have a spare room, so set him up in our 11y/o son’s room with a foldout bed. We agreed on £160 a month, which covered bills/food. However he quickly started complaining about doing the dishes (only chore we asked him to do) and spent his money on nights out and other stuff instead of saving to move out. After a few months, it was clear he wasn't saving at all. When brought up, my husband said BIL had until March to move out, he was shocked by the deadline. We offered until end of August, with rent increased to £250 a month, which he agreed to. But he would consistently ignore basic requests: keeping the bathroom window open when showering to avoid mould, picking up his dirty clothes, keeping his stuff in our son's room organised and not sleeping in the living room overnight, we spend 80% of our time in that room, it's a family room NOT a bedroom. By august, BIL is no closer to moving out which i KNEW would happen. Instead, he booked a holiday, started saving for that, showing he can save and taking us for complete mugs. Rent went to £400 a month, hoping that would encourage him to leave because we can't just throw him out. He viewed a place, it fell through, and he blamed his friend- told us WE should be having a go at his friend instead as if WE'RE responsible for him. He’s now been living with us nearly 18 months, paying low rent considering everything is included (even toiletries as he has not bought any since moving in). He works full-time and makes above minimum wage. I no longer like being around him, i find him rude, entitled and arrogant. The tension has caused strain between me and my husband, I’ve tried to talk to him about it (A LOT), but he doesn’t want to aggravate the situation, even though he agrees with me. I’m frustrated because every time i broach the subject i feel dismissed and i just need to put up with it until he moves out, even if it means letting BIL act/talk to me in a disrespectful manner. My husband isn't afraid of confrontation but can't be bothered with it as we're stuck with him in house. As he doesn't back me up BIL doesn't take me seriously and i feel like I’m not being supported in my own home. He's had enough of me going on about it, I've had enough of dealing with the whole thing. BIL is due to move out in 4 weeks-he's moving into his friend's (+ friends gf and 4 kids) attic as he never looked for anywhere, the whole situation has left me emotionally drained. I’m wondering if I’m overreacting or if my feelings are justified. Our friends agree BIL is miserable to be around and I’m tired of the cr*p i'm putting up with, should i continue to let it go over my head?",
        "gilded": 0,
        "title": "AITA for wanting my BIL to be held accountable for behaving like a spoilt child for 18 months whilst living at ours, even though he's moving out in 4 weeks - or should i just carry on letting it go over my head to keep the peace even though it makes life at home miserable",
        "upvote_ratio": 0.77,
        "ups": 55,
        "link_flair_text": "Asshole",
        "created": 1738442125.0,
        "num_comments": 78,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iffp6n/aita_for_wanting_my_bil_to_be_held_accountable/",
        "num_crossposts": 1
    },
    {
        "selftext": "Me 14m am autistic and have issues with going to school today I had an argument with my mom and dad about me trying to go to school again and my dad got upset and said that my life will be just watching YouTube and playing video games and he doesn’t give a shit what do I do",
        "gilded": 0,
        "title": "AITA My dad told me that my all I will ever do in my life is play video games and watch YouTube",
        "upvote_ratio": 0.38,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738636169.0,
        "num_comments": 94,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih7ahq/aita_my_dad_told_me_that_my_all_i_will_ever_do_in/",
        "num_crossposts": 1
    },
    {
        "selftext": "My (26F) parents own the 2-bedroom condo I live in, and my boyfriend (28M) moved in a few months ago. We discussed rent beforehand, and he was fine with paying. I initially told him $1800,  in addition to splitting utilities 50/50. He agreed. For context, comparable 2-bedroom condos in our area (a desirable part of Southern California) rent for around $2800, meaning $1400 per person. My parents aren't charging *me* rent, which is incredibly generous. However, they see the condo as an investment property, and the rent they would charge me is factored into their financial planning. I send them a portion of the rent I collect every month. I also pay the HOA dues and property taxes (which are substantial in California). Everything was fine for a few months. Then, my boyfriend was looking at rental listings and realized that *individual* rooms in comparable condos are going for around $1400. He also found out (from me, I wasn't hiding it) that I technically don't pay rent myself since my parents own the place. He completely flipped out. He accused me of trying to profit off him, saying I'm taking advantage of him because I'm not paying rent. He argues that since I don't have a rent payment, the $1800 is mostly profit for me. He thinks he should only pay half of what *I* pay in combined HOA dues, property taxes and utilities. I admitted that the $1800 wasn't just based on splitting a theoretical $2800 rent. I told him I added a bit extra because I'm the one paying the HOA fees and property taxes, and I’ve been responsible for general upkeep of the place. I also have to send a portion of the rent money to my parents. I acknowledged that it's more than half of what a comparable room would cost. He's not having it. He keeps saying I'm ripping him off and that I should only charge him half the combined HOA, taxes, and utilities. He’s now refusing to pay the agreed-upon $1800 and is only offering what he calculates as his share of the combined HOA, taxes, and utilities. I feel like I'm being reasonable. I'm not trying to get rich off him. I'm just trying to cover the actual expenses associated with the condo. Am I the asshole here? Should I just lower the rent to appease him, even though I feel like I'm not doing anything wrong? This is making things incredibly awkward. EDIT: There is no mortgage. My parents bought the place cash as investment property. I have been living here rent free for about 8 years and have done some remodeling at the time, and have had friends as roommates here and there whom i also charged rent, but usually those cases were when those friends were suffering financially so they paid under market value.  My parents did not ask me to charge my boyfriend rent or for me to send them money, they basically say it's my choice to use the place as I want for now.  I send them 1k a month because technically it is their place and so I feel they should get a share of the rent. EDIT - UPDATE   For everyone assuming/asking if I am pocketing the money. NO I AM NOT.  It;s like this:  I send 1k to my parents since it's their place, and every time I've had a roommate I've sent them a portion of the rent without them having to ask. BECAUSE they bought this place as an investment property. I was originally going to fic it up and rent it out but stayed longer than I planned and they have never charged me rent. So I am holding them back from it being a full time rental property so of my own initiative I am sending them rent whenever I have roommates before they can ask me for it.  1k to parents $500 - HOA dues  $100-150/mo utilities Property taxes - somwehere between 5-10k/year So I'm usually left with $150-200 every month after paying my parents and HOA and utilities, and even combined over a year it would still not cover even half the property taxes, which I am willing to keep covering fully myself.   I am not pocketing anything or making any money from what I charge my boyfriend for rent. ",
        "gilded": 0,
        "title": "AITA for overcharging my boyfriend on rent when he moved in?",
        "upvote_ratio": 0.38,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738404844.0,
        "num_comments": 94,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1if3de1/aita_for_overcharging_my_boyfriend_on_rent_when/",
        "num_crossposts": 2
    },
    {
        "selftext": "My (35F) wife (32F) is saying that I tend to cheap out on gifts for her, especially for her birthday.  One year for my birthday she got for me a custom work jacket that I said that I’ve been wanting, but for her birthday I got her a card and a trip to a restaurant she liked, to which she felt quite undervalued. I feel like that the gifts were appropriate for each other but am I the asshole for not trying harder? Please don’t hold anything back. ",
        "gilded": 0,
        "title": "AITA for undervaluing my wife?",
        "upvote_ratio": 0.35,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738462732.0,
        "num_comments": 89,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifmv6v/aita_for_undervaluing_my_wife/",
        "num_crossposts": 1
    },
    {
        "selftext": "Me (29f) and my boyfriend (33m) live in a huge house with 3 other guys (all in their 30’s). The owner sold the house and gave us 60 days to move out. The law in my city states we get 2 free months of rent in these situations. (15K in our situation)  But the new owner wants us out faster than that and offered us $30K to be out at the end of the month. We took it but now we have to divvy up the money. My thinking is we should take the first 15K and divide it by what we pay for rent normally, then the extra 15K on top will be split evenly 5 ways.  Everyone else thinks we should split the entire 30K by how everyone pays rent. Which i think is ridiculous, because that extra $15K was never part of the plan. No one should be entitled to a percentage of something they didn’t pay into? They’re thinking about it like a business, an investment. But rent is a bill, not a business. That extra money came about purely bc of a situational issue, not bc more money was “invested” I feel taken advantage of by my friends and even my own boyfriend.  EDIT: the extra $15,000 is coming from the new owners not our rental property manager, it’s not tied to a rental agreement",
        "gilded": 0,
        "title": "AITA for suggesting we split the extra $$ my roommates and i were offered 5 equal ways?",
        "upvote_ratio": 0.39,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738348533.0,
        "num_comments": 86,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ielrbr/aita_for_suggesting_we_split_the_extra_my/",
        "num_crossposts": 0
    },
    {
        "selftext": "Hi so currently I’m in a situation and I’d like an outside perspective as my family think I’m an asshole!! Sorry in advance if there is any spelling mistakes and punctuation errors, I’m typing this fast as my wife is getting our daughter ready for bed. So I Adam (19M) is married to Keeley (19F) and between us we have a little girl Iris (3F) turning 4 in a few weeks. Keeley and I got married last year after being together for 6 almost 7 years - we got together at 13 and we have been friends since the age of 10 . During our entire friendship and beginning of our relationship Keeley had no minim/ non existent relationship with her dad - he pretty much abandoned her and her siblings and from what she’s told me over the years, he was an absent father throughout her entire childhood. Keeley’s mum met her step dad when Keeley was around 6, and from then on her dad became even more absent and when he would have her and the siblings, she would be the one looking after everyone when only being the middle child. During last year’s wedding preparations Keeley’s dad wanted to walk her down the aisle on her wedding day. I didn’t see the problem with that but Keeley was set in her ways and told me and her entire extended family that her step dad was going to walk her down the aisle and if anyone had a problem with it they would have been uninvited to the wedding. Fast forward to now, I’ve been meeting with her dad, we will call him Ben (46M) every couple of weeks to catch up and update him on how iris and Keeley is getting along ( iris is in nursing and Keeley is going to uni in September to be a nurse). This week when I met up with Ben he expressed a desire to get to know his granddaughter as he said “he doesn’t know how long he’s got left) let me preface this by saying Ben has tried to use this tactic over the last to get Keeley to talk to him and as Keeley told me he used this as an excuse when she was kid, when she wouldn’t do something he wanted.. but I don’t know if he is being honest or if he is actually gonna die soon. I guess I want Keeley to talk to her dad, as I didn’t have a dad growing up, my dad died when I was 9 years old - that’s the reason we moved and then that’s when I met Keeley. He wants me to bring iris to our meet ups or ask Keeley to hear him out. After the conversation I went to my mums house to ask for advice and she said i definitely shouldn’t bring up this up to keeley and to stop meeting up with ben. I’m considering just telling keeley everything and dealing with the fall out afterwards.So Reddit, Would I be the asshole if I asked my wife to talk to her dad? I don’t know why I didn’t think of this but this is the only relationship I’ve ever been in and I’m actually super close to her step dad.  Edit - hello everyone! I just want to say thank you for all the comments and messages I’ve received. Firstly, I wanna address people this story and account fake - I can assure you it is not, this is my real life and the account is a burner account as I do have a normal Reddit account and I have done since I was 15 Keeley just follows that one so I had to make a new one to address this matter. Secondly, people saying my story doesn’t match up with our ages, we had our daughter at 16, which is almost 4 years ago, I turn 20 on the 16th January and then iris turns 4 on the 25 of February and then the following month Keeley turns 20. Keeley is starting uni in September as she took some time out of education to be 100% present for iris first 9 months that’s the reason she is going. Also when I say iris is in nursery, I mean it’s like a play group thing she goes to everyday, my mother in law takes her for a few hours while I’m at work and my wife is at college. I just also wanna preface this by saying No, iris was never planned, we never planned to have kids till at least our twenty’s, but when we found out Keeley was pregnant we had a long talk and decided that we both could do it and she’s an amazing mum. In the last 3 years Ben has had nothing to do with Iris - as some messages were saying - and it wasn’t due to my wife’s lack of trying, he didn’t want have that relationship with her. Lastly, after reading through all you’re comments I can clearly tell I’m a huge arsehole, Keeley has no idea I’ve been meeting with her father and as some of you have said it’s a huge breach of trust which is completely is. A lot of you are saying that he is using the situation with my dad against me and I never thought of this until it was mentioned. When thinking back to our meetings I can definitely say this is the case, him bringing up how, he thinks that my relationship with my dad would be now or how my own fathers relationship with my daughter would be. The people saying that this is a reason for Keeley to leave/ divorce me is a bit far fetch, Keeley is an understanding woman and she would never do something like that unless it was absolutely necessary. I’m writing this on the way to wok. Tonight when I get him I’m gonna to show Keeley this post, comments and all the messages I’ve received and we shall go from there. I wanna say thank you to everyone who took the time to read this post, even tho I’m a hide asshole. ",
        "gilded": 0,
        "title": "AITA for asking my wife to have a conversation with her dad?",
        "upvote_ratio": 0.33,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738528191.0,
        "num_comments": 85,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ig6tft/aita_for_asking_my_wife_to_have_a_conversation/",
        "num_crossposts": 3
    },
    {
        "selftext": "I 40f and my husband 42m have two wonderful kids 10m and 7f.  Our kids have never been the best of friends or even got along that well most the time, they would bicker and argue with each other call each other names and do things they knew annoyed the other to purposefully get under their skin.  I don't want to go in to detail but we've had some financial issues lately that caused a bit of a strain on our marriage, we would argue a lot late at night when the kids were in bed and often wouldn't go to bed ourselves until 2 or 3 :am ( even when we had work the next day).  I'm ashamed to say that it turns out our kids would often wake up and hear our late night arguments and this actually gave our daughter nightmares, I found this out when I went to wake my son and saw his sister in bed with him, that's when he told me she had a nightmare and got in bed with him because my husband and were still up fighting.  This broke my heart to know we made our daughter scared and weren't  there to comfort her,  we made sure to keep our arguments as quiet as possible and reasured our daughter that sometimes mommy and daddy fight but she didn't need to worry about that and everything would be okay.  We kept our arguments to a minimum and were as quiet as possible, but our daughter still had nightmares the next few nights and got in bed with her brother.  We were able to get a handle on our financial issues and stop fighting so much. We reassured the kids that  everything would be okay and that they didn't have to worry. After a few nights our daughter was back to sleeping in her owne bed.  Ever since then our kids have gotten much closer, they play together, watch shows together, goof around together, and treat each other with much more love and respect then they used to. They even hug each other goodnight every night.  They still have arguments and bicker but it's much less and they  have an overall very loving relationship.  Today my daughter drew her brother a picture of the two of them playing in our yard with the words  best big brother in the world written really big on top.  My son loved it and showed it to us and asked if we could have it framed, as I mentioned we have been having financial issues lately and I really don't think we could afford to frame it.  I told him he didn't need to frame it, he could just hang it up on the wall. But he said he wanted to frame it because special pictures get framed and this is the most special picture he has. I tried to tell him gently that we can't afford to frame it but he and his sister are still upset.  I asked my husband about it and he said maybe we should get it framed because it's so special to our son and there new found closeness could maybe be hurt by us refusing to frame it.  The last thing I want to do is hurt there new close relationship but I still don't think we can afford to get it framed.  AITA? Edit: We went to Walmart and got our son a frame for his sister's picture, we put it up on his wall right across from where his bed is and he absolutely loves it!  We're very glad his relationship with his sister is so much better and seeing her picture for him everyday means so much to him. We're so glad we were able to get a frame for him.  Some of you seemed to get the idea we were just cheap or that we just didn't want to spend money on the kids, that's absolutely not the case. The kids have lots of toys, their owne bikes and phones and of course all the essentials.  My husband and i didn't realize that there were options for cheap picture frames but we were delighted to find out there were.  Thank you all! ",
        "gilded": 0,
        "title": "AITA for refusing to frame a picture for my son?",
        "upvote_ratio": 0.55,
        "ups": 4,
        "link_flair_text": "Asshole",
        "created": 1738387504.0,
        "num_comments": 83,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iezcr3/aita_for_refusing_to_frame_a_picture_for_my_son/",
        "num_crossposts": 2
    },
    {
        "selftext": "Ex-wife, Sharon (31f) and I (32m) had a messy divorce. In a hasty decision to have everything settled, I kept the division of property and debt as simple as possible - I take care of my credit cards, she takes care of her credit cards, car and car loan. (If it matters, we're divorced in Nevada, US). Years later, I filed for bankruptcy because I was struggling to pay the debt (about $15k) we accumulated together. As stated in the divorce decree, she is responsible for the car and car loan. However, I am primary, and she is co-signer. Both of our names are on the title and registration. Eventually, I know she'll need something from me like a signature for the car. She refuses to refinance because she doesn't want to meet with me. Mutual friends have been saying I should have collected money from her for partial amount of the debt. I don't have as good of a job as she does now.  WIBTA if I asked for money to settle the car situation? Is this even legal? The debt covers some furniture in her home, along with fast food, trips we've done together, ect. We were reckless young adults. I've learned my lesson.",
        "gilded": 0,
        "title": "WIBTA if I requested money from ex-wife after divorce",
        "upvote_ratio": 0.4,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738322728.0,
        "num_comments": 76,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iecnfl/wibta_if_i_requested_money_from_exwife_after/",
        "num_crossposts": 1
    },
    {
        "selftext": "For context, I have been with my girlfriend for 11 years and I turned vegan 3 years ago for ethical reasons. Before that, I was not eating a lot of meat, but I knew that I was not really doing the best thing (ethically). I was not vegan because I did not want to create any friction with family, friends, etc. but at some point, I decided to go vegan. For me, it doesn't make sense to kill/harm animals when I can just buy a can of chickpeas or buy some tofu instead. My girlfriend understands this and stayed omnivore, because she doesn't want to give up on things that she loves to eat. We live together so, me switching up to veganism obviously impacted her since we cook together only vegan/vegan adaptable meals. She sometimes buys cheese, milk, chicken and fish that she cooks for herself. Other than being vegan, I have a full time job and have many hobbies that take a lot of my time (competing in Ironmans, learning multiple languages, etc), so it is a struggle to spend a lot of good quality time with my girlfriend. Anyway, on her birthday, I came late from work and I went to a restaurant where they make some Poke bowls. I wanted to make her happy and knew that if she was with me, she would order the salmon poke bowl, but I ended up ordering a vegan Poke bowl anyway, because I did not think her birthday would justify me spending money on an industry that I really don't want to encourage. I felt that even tough it would no be her choice, it would still be a nice gesture. When I came back home with the vegan poke bowls, she was disappointed and kind of angry at me because she knew exactly what went in my head when I bought the bows. She felt that even on her birthday, I could not do any compromise and think solely about what she wanted. She says that even when I give something to somebody else, I don't put myself purely in their heads and that I always filter my actions based on MY standards. What do you think ? Edit : Thank you for all your comments. I am a selfish a*hole and definitely have to work on being a better boyfriend and a better person in general. My girlfriend is a wonderful person and I mistreated her. I will put myself more in her shoes next time I want to treat her and put myself and my standards out of the way. ",
        "gilded": 0,
        "title": "AITA for giving vegan food to my girlfriend on her birthday even though I knew she would have preferred something else.",
        "upvote_ratio": 0.24,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738866804.0,
        "num_comments": 73,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij9o86/aita_for_giving_vegan_food_to_my_girlfriend_on/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (f19) have been going to the same tattoo artist (m28) since I was 17 I’m now in a relationship and we have been together for 6ish months(m21) I got a tattoo of an animal and ever since then my tattoo artist and I have been sending each other funny videos of the animal which has just become normal and funny but since being with my bf he has unliked posts my tattoo artists put up on my phone and unliked messages let me get this clear there is nothing apart from some funny animal videos but my bf just doesn’t like it he has already blocked my tattoo artist on Facebook through my phone and to be honest it’s just made the whole experience awkward apparently my tattoo artist giving me a discount because I’m a returning customer is considered flirting not to mention he is in a relationship himself and I have told my bf that many times  Last time I went to get a tattoo he asked me if I was ok and if I was uncomfortable with him messaging me outside of tattoo business and I said no not at all and just explained that my partner doesn’t like it and he told me that my bf was insecure and I need to leave him-I vent to him about stuff anyway my boyfriend and I got in an argument and I told him what my tattoo artist said out of anger and my bf wants me to block him but I haven’t and we’re still sending videos but I’m hiding it from my bf… AITA help plz",
        "gilded": 0,
        "title": "AITAfor not wanting to block my “flirty” tattoo artist",
        "upvote_ratio": 0.4,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738561052.0,
        "num_comments": 72,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igi39z/aitafor_not_wanting_to_block_my_flirty_tattoo/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (31f) recently drifted away from a friend (25f). I thought this happened naturally, (not hanging out as much / not talking over instagram etc.) but she felt hurt by the distance. We “broke up” over text after the she sent l an incredibly long “what did I do?” to which I responded in summary “nothing really, I feel like we’re just in different parts of life. I wish you the best though!” I realize now this text was the opportunity she wanted to launch into a diatribe of all the things I did wrong in the relationship and that she felt offended by. I had NO idea. One of these things was a miscommunication about driving to the airport. (A year and a half ago!) She messaged me in August 2023 about driving her to the airport at 6 in September. I said sure, even though this is something that I would not normally ask of a friend (I would ask my mom for or get an uber. Gas is expensive!) but I thought “well, she doesn’t have a lot of family here” so I said sure, you can get me a coffee and we’ll call it even. I’m a morning person so I figured she was asking me to drive her at 6 am. If I had known she meant 6pm I would have not agreed in the first place.  So flight day arrives and I roll up to her place at 6. I call her. Dial tone. Finally I get a hold of her and she says that the flight was at 6pm. We both apologized for the misunderstanding. I go back home to bed. I get up for work and am feeling (understandably?) tired and a bit grumpy. I send her a text saying “hey, I’m not upset at you, but I am a bit grumpy about this miscommunication and am going to have to politely decline to drive you at 6pm tonight to rest” I gave her notice and she replied “totally fair, I’m so sorry for the mix up!” and she sent me a starbucks giftcard for my trouble, which was a sweet but totally unnecessary gesture. She got to the airport, I wished her a nice vacation, and we caught up when she got back. I thought all was well.  Folks, all was not well. She had apparently held on to this resentment as “I broke a promise” to her. She said me cancelling was selfish cause she couldn’t afford an uber and was shocked that I didn’t rearrange my schedule to drive her at 6pm. She apparently had to take a bus and then get another friend to drive her “who dropped everything for her”. She was flabbergasted that she “sent me the giftcard and then I cancelled! WHO DOES THAT?!” Apparently I didn’t prioritize her and didn’t care about her feelings and wellbeing as I knew how much this trip meant to her. I looked back and she sent me the giftcard after I declined to drive her. I thought it was a nice gesture at the time, but now I feel like she felt like I owed it to her to say “aww, since you got me coffee I WILL drive you now”. I thought this was a simple favour that I could revoke cause circumstances changed and not “a promise”. I am doubly confused cause she said over text that it was fine at the time. Am I the asshole for not realizing this was a dealbreaker? ",
        "gilded": 0,
        "title": "AITA for not driving my friend to the airport?",
        "upvote_ratio": 0.7,
        "ups": 22,
        "link_flair_text": "Asshole",
        "created": 1738437069.0,
        "num_comments": 62,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifdryo/aita_for_not_driving_my_friend_to_the_airport/",
        "num_crossposts": 1
    },
    {
        "selftext": "I am currently on a bulk and have a set rhythm and pace that i like to follow when training as I feel it helps me maximise what I’m doing. I arrive at the leg press and prepare to do my first set when a larger male approaches me, looks to be 22 years old,  and is evidently quite sweaty. He asks me if we would be able to share the machine and alternate between sets. I politely declined and had not specified any reasons as I did not want to come across as rude. He immediately asks how many sets I plan on doing to which I respond 6. He then says that I would be wasting his time if I didn’t share with him and that I was selfish for not sharing. I was starting to become  annoyed and told him it’s my prerogative to train how I liked and that if he was not satisfied he can go get the manager. He then proceeded to tell me that I was a selfish loser and walks off. I feel like not wanting someone to disrupt your rhythm, and also not wanting to share with someone who is sweating is a fair enough reason to not share your equipment. But isn’t it also my right to use the equipment by myself if I so choose? I thought it was natural that sometimes machines are in use and you just have to wait? Just wondering if I’m the A for not wanting to share, and wondering whether my gym etiquette logic needs rethinking thanks.",
        "gilded": 0,
        "title": "AITA for not sharing gym equipment ?",
        "upvote_ratio": 0.49,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738779901.0,
        "num_comments": 65,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iigvql/aita_for_not_sharing_gym_equipment/",
        "num_crossposts": 1
    },
    {
        "selftext": "So my hubby my bf of 9 years and 3 kids later - constantly wants to say he is leaving me when he gets mad about something. We have 3 kids together, and i have 2 older children from a previous relationship. I feel like hes constantly like 'my kids'..'your kids' when in actuality they are all my kids. I love all 5 of them. They are aged 14, 12, 6,5,3. Hes always getting on the older ones and I feel like they do everything while he sits at home playing video games - cause thats his me time. Meanwhile, i work and support the whole houss. I work about 80hrs a week, and when i am home - i guess i do try to over compensate by doing the housework. Then he says I baby them and wont teach them how to be responsible etc etc.. im an awful mom because i am never home...and now when he gets on his feet - hes leaving. (Mind you, I helped him get a great paying job with pension etc ) Am i wrong for being like - okay bye? Im about to graduate school and have an even better paying job. ",
        "gilded": 0,
        "title": "AITA for agreeing he should go when he says he is?",
        "upvote_ratio": 0.81,
        "ups": 75,
        "link_flair_text": "Asshole",
        "created": 1738863439.0,
        "num_comments": 46,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij8aeq/aita_for_agreeing_he_should_go_when_he_says_he_is/",
        "num_crossposts": 1
    },
    {
        "selftext": "This is my first post please be nice 😭. I (19 M) was talking to my coworker (26 F) about how my ex stepdad/My brother's dad was supposed to help me move in one Friday (he offered because I was living with him), but when I called to ask him if he was ready and he was confused on what I was meaning and he didn't know we would be doing it so early in the day. (it was a little before noon but he was told a week before when and what day) He had to go to one of his younger kids school to have birthday lunch with her which was fine I said we could do it after, but his now girlfriend ( not my mom) said I was trying to ruin her daughters bday and I was an asshole and must of planned it. So he hung up called me back and asked if he could do it Saturday, but I had to stay at a family friends house to watch their dogs and so I said that was fine and I would send him a picture of how I wanted it since I couldn't be there to help him or do it myself. Well he had got there threw it in my room not at all how I sent him and my roomates family had to do it because they felt bad.  I was upset more because they had to do it and I didn't say anything to him about it and still thanked him for doing it... but my coworker said I was an asshole for trying to make him  set up my whole house and I was being entitled. I feel like considering I had it all planned for him but he forgot about it inconveniencing me and then I couldn't be there I was in my rights to be frustrated with him... So am I the Asshole?  edit-  I feel like people are coming at me because I started a fight with him or something but like the the oh post I thanked him for doing it and offered gas to which he said no to, I didn’t argue with him about it but I feel I should still be able to be upset that he didn’t do it when he said he would and told my roommate and her family he knew how I wanted it but didn’t care to do and said I wouldn’t mind in left.  obviously I do mind and he didn’t put like pictures or thing small things like that for me up he just had to put a bed and my desk in there and that was it. I was unable to be there because he had forgot to plan accordingly which lapsed into my plans I had to watch a house which has been set in stone months in advanced thank you for ur comments! ",
        "gilded": 0,
        "title": "AITA For being mad my EX step dad didn’t set up my room in my new house the way I wanted?",
        "upvote_ratio": 0.33,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738609479.0,
        "num_comments": 63,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igwz7q/aita_for_being_mad_my_ex_step_dad_didnt_set_up_my/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (19M) have a friend (19F) who is super sensitive. You never know when she'd find something hurtful. And when she does, instead of talking about it normally, she almost tries to act like a victim. If it's a simple discussion, she'd accuse me of trying to make myself look right, she would just say forget it or u won't understand me. 3 days ago she told me about her academic struggles and how she isn't able to manage. Naturally I gave her advice which has helped me too. Not in a condescending way at all. She then proceeded to tell me that she often thinks I look down on her. When I asked her to explain further, she again said forget it. After this, she acts cold as always, expecting me to apologise over text everytime, or try to call her. I didn't contact her at all, but if I really am insensitive, I don't wish to ignore this either",
        "gilded": 0,
        "title": "AITA for not apologising to my friend",
        "upvote_ratio": 0.52,
        "ups": 1,
        "link_flair_text": "Asshole",
        "created": 1738601706.0,
        "num_comments": 62,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igtpyz/aita_for_not_apologising_to_my_friend/",
        "num_crossposts": 1
    },
    {
        "selftext": "My brother (48) passed away about a year ago - complications from alcohol addiction. He and his ex gf had a terrible and long relationship (10 years), in which she was cruel to me and my mother. They broke up, she threw him out, she took him back. We took him into out home to get him clean, and she came and picked him up. He got DUI’s, we left him in jail to detox, she bailed him out. She refused to quit drinking and enabled his alcohol issues. She said they were in love, and other times she said he was a ‘homeless guy’ that lived with her.  My brother came to my house under hospice care, and given the animosity, I asked her not to come to my home. She did tell him goodbye at the hospital, and then screamed at me and my mother over his hospital bed because she blamed us for his issues. After my brother passed, my mother had him cremated and kept all of his remains. Immediately after he passed, I updated the ex and asked if he had any belongings at her house (he had family heirlooms, tools from my deceased grandfather, etc.) She told us she had thrown away his things and anything he had left was hers, since she had bought it.  Every other month, she sends me drunk messages demanding ashes and insulting me when I say no. She has never once expressed sympathy towards me or my mother.  I am done with the messages. I am thinking of getting a tiny urn and filling it with ashes from my cremated pets, and giving her that just to resolve the issue.  So Reddit - WIBTA if I lied to my brother’s ex and gave her pet ashes instead of my brother’s?",
        "gilded": 0,
        "title": "WIBTA giving my brother’s ex gf fake ashes?",
        "upvote_ratio": 0.84,
        "ups": 42,
        "link_flair_text": "Asshole",
        "created": 1738873192.0,
        "num_comments": 50,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijcauc/wibta_giving_my_brothers_ex_gf_fake_ashes/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (F 28), and my finance (M 27) are getting married in April in Mexico. We planned a huge brunch for our friends to ask them to be a part of our wedding party back in March of 2024. Everyone of course said yes, however, as time went on, a groomsman needed to back out so we needed to backfill the position to make it equal for our wedding party to walk down the aisle. Of course, it didn't bother me that my brother-in-law was not initially asked because my finance does have a lot closer friends that he has been friends with for years and we hang out with every weekend. When going over who my fiance was going to add to his side of our wedding party, he mentioned asking another friend of his, I told him it should be my brother-in-law and not his old best friend. Some background, my fiance and my brother-in-law are pretty close, we see him and my sister quite often as my sister is one of my best friends, and our kids (6) are the same age and hang out all the time. This friend that my fiance wanted to add to his wedding party was a really good friend of ours when we first started dating, he and his now finance were some of our best friends that we hung out with every weekend, however, we stopped hanging out with them both for about two years as the friend would make comments about me being a stay at home mom and living off my finance. Me and my fiance both agreed that I would be a stay-at-home mom while I finished college. Fast forward to today, we reconnected with our friends and after a serious apology from my fiance's friend we started to become a part of each other's lives, We only see them maybe once or twice a month, so I was confused as to why my fiance would want him in our wedding over my brother-in-law. I understand that they were best friends for years, and this is his side of the wedding party but my brother-in-law has always been there for us and never has done us wrong. So am I the asshole for asking my fiance to have my brother-in-law over his old best friend?",
        "gilded": 0,
        "title": "AITA For asking my fiancé to have my brother-in-law as a groomsman for our wedding",
        "upvote_ratio": 0.44,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738342729.0,
        "num_comments": 60,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iejel3/aita_for_asking_my_fiancé_to_have_my_brotherinlaw/",
        "num_crossposts": 0
    },
    {
        "selftext": "I (28F) live with my boyfriend (28M). I work a state govt job that keeps me out late while his job in IT is flexible so he works from home sometimes. We have been dating for a couple years now and recently he moved in with me. I bought the house and pay the mortgage for it entirely. My BF does not pay me any rent since he is currently in a low paying job and actively looking for better options. However he also has the longer commute to work so he pays more for gas now ever since he moved in because previously he lived closer to his workplace. Until he finds a new job, he told me he unable to contribute for the mortgage and hasn't asked to be on the deed either. He does however pay half the utilities and half of the groceries too. He has been extra conscious about not contributing to the mortgage or paying any rent. Since he doesn't pay rent, he tries to make up for it by doing almost all of the cooking for both of us. He also does the laundry and dishes most of the times without complaint. And when I ask him for help cleaning the house like mopping the floors, he helps with that too. He also packs my lunch every morning to save me the trouble of getting up early. I am really lucky that he does all of this. However, he does make a mess (kitchen and bathroom) and his cleaning isn't as good as when I would do it. We also buy a lot of groceries which we have nowhere to put since the house is somewhat small which makes the house a mess again. I didn't have this problem when I was living by myself so it has started to irritate me quite a bit over time. This past weekend, when he was cooking, he happened to drop rice and some sauce on the floor and hadn't cleaned up after so I told him you need to be more careful about dropping things on the floor cause you make a mess sometimes. It caused him to get upset and he started profusely cleaning the floors. Then he proceeded to tell me I know this is your house, but it feels like I need to tiptoe around you here because I am not keeping the place exactly how you want it. I make a mess sometimes but I always clean up after. Might not be immediately but I do get to it and I do my best. I'm sorry that isn't good enough. And this isn't the first time you've said this. He told me the other time this happened was when he was cleaning out our oven and while scrubbing the burnt bits, it dropped black spots all over the white floor which irritated me. And apparently I had told him that he didn't do a good job cleaning the floor one time when I had asked him to do it. After he told me all this, I got upset because and started crying and he spent the next hour consoling me. I am neurotic about keeping the place clean - especially my kitchen since I have had a rodent problem. Ever since this, I have always found him on all fours on the kitchen floor trying to find every last speck of food because I feel like he is convinced that I would get upset again. AITA for telling him he made a mess in the first place and wanting to keep my house clean? EDIT: Clarified being on the deed EDIT 2: I deleted all my replies to the comments because I kept getting downvoted on every single one. I don't understand the downvotes to my replies when I have only thanked the commenters, been civil with my replies and taken their suggestions as good ones and agreeing to make some changes in myself. ",
        "gilded": 0,
        "title": "AITA for being neurotic about keeping my house clean and telling my boyfriend he made a mess",
        "upvote_ratio": 0.39,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738765430.0,
        "num_comments": 58,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iib2gp/aita_for_being_neurotic_about_keeping_my_house/",
        "num_crossposts": 1
    },
    {
        "selftext": "I broke up with my ex three years ago, but I still had a teddy bear from him. I didn’t take it with me when I moved to the city where I study, I left it at my mom’s house. Since it was fluffy and comfortable, she started sleeping with it every night. After spending a year abroad, I came back to my hometown for a month. Every time I saw that teddy bear, it reminded me of my ex and the moment he gave it to me, so I decided to throw it in the fire without asking my mom. I didn’t think she was that attached to it, I only considered that I didn’t want anything from my ex in the house anymore. Three days later, my mom asked about the teddy bear. When I told her I had burned it, she got really emotional, even to the point of crying. She said she had slept with it every night for the past three years, that it was really comfortable, and that it helped calm her breathing and anxiety. I genuinely hadn’t considered how much it meant to her. I told her I’d buy her a new one, but I haven’t been able to find the exact same one yet. AITA for burning it without asking her first? EDIT: It was not just the teddy bear that I threw, it were all the things I had home from him, and not because I am angry at him or not moved on, but I did not want to have them anymore. I only mentioned the teddy bear as my mom was attached to it, thing I was not aware of.",
        "gilded": 0,
        "title": "AITA for Burning a Teddy Bear My Mom Slept With Every Night Because It Reminded Me of My Ex",
        "upvote_ratio": 0.32,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738867528.0,
        "num_comments": 57,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij9yow/aita_for_burning_a_teddy_bear_my_mom_slept_with/",
        "num_crossposts": 0
    },
    {
        "selftext": "Both me and my friend, Jane, go to a really competitive high school--but because we're friends, we never let it really get between us. We both even applied to a lot of top scholarship (QuestBridge, Gates, Coca-Cola, etc) and made it to finalist stages for QuestBridge together. In December, Jane matched to Duke University and only had to pay $10,000 over the course of four years. I did not get matched, so I did not receive the scholarship, but made finalist for the Gates Scholarship. This didn't tear our friendship apart but instead brought us closer--I was sad, of course, but I was happy for her. Fast forward to earlier today. She heard back from another big scholarship, and I told her to rescind her application as she already has QuestBridge. She did. Then, she heard back from another, and I told her, again, that she didn't need the money and to leave the opportunity for someone else who did. A couple hours passed, and she comes up to me asking for help with her essay, and I look at it with her. Then, she tells me that it was highly inconsiderate of me to tell her to rescind her applications, especially because I knew how much she needed it. At this point, I had taken two exams back-to-back, and was fed up w ppl. So I told her how it wasn't fair for people like me who didn't get matched, but deserved the money just as much as her. She then says how they have medical bills back from when her mom had cancer, and that it wasn't fair to her family that they pay for her school. I said that she could take a job, both during the summer and in college, so that they don't have to pay for her, but she stormed off. Now, I'm scared that I ruined our friendship, especially with something as small as this.  So, AITA?",
        "gilded": 0,
        "title": "AITA for telling my friend to rescind their scholarship applications?",
        "upvote_ratio": 0.27,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738643719.0,
        "num_comments": 57,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih9ndo/aita_for_telling_my_friend_to_rescind_their/",
        "num_crossposts": 3
    },
    {
        "selftext": "My husband just received a promotion/new job offer at his job. His place of employment has historically not been a positive place and has been the cause of deep stress for him and strain on our relationship; however, it was recently bought out so company ownership is different and this new position would be kind of a fresh start. He let me know about his new position after he accepted it yesterday. He said that he cares how I feel about it and that he knows it has been rough but he thinks this will be a good thing. I do have mixed feelings, but I am incredibly happy for him and proud and I let him know that. I let it sit and gathered my feelings about all of it and then tried to talk to him about it today. I told him that I am happy and excited for him and that I want to support him in this, want to ensure we respect each other’s feelings, and communicate so we can move forward positively together. He lost it. He said that I hate his job and will never be happy, that he does not want to discuss it - ever -, that he should not have to be my therapist and talk to me about it… the list goes on. I repeatedly told him I am happy and that I am not upset or angry and that it was a conversation about moving forward with mutual respect and positivity and I did not understand why he was angry and asked if he could tell me what he is upset about so I can try and understand. He could not tell me and just kept saying he never wants to discuss it and that I just always cause problems and am never happy. I am at a loss. I told him I apologize if I miscommunicated somehow, but I literally just wanted him to know that I support him and that even though it has been tough there I want us to move forward supporting and respecting each other (that is the text I sent him verbatim). AITA here? ** update - the stress and strain I refer to is that he has been so stressed he has stopped taking care of himself, going to workouts (which he loves), being angry at everything and snapping at everything all the time. He knows he is doing that and apologize saying he is sorry and that he is just stressed and needs to find a new job because he can’t take it, feels disrespected there, and feels terrible for taking it out on our family. So it has affected our family. ",
        "gilded": 0,
        "title": "AITA for talking to my partner about his new job",
        "upvote_ratio": 0.62,
        "ups": 6,
        "link_flair_text": "Asshole",
        "created": 1738681435.0,
        "num_comments": 53,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihjnlf/aita_for_talking_to_my_partner_about_his_new_job/",
        "num_crossposts": 1
    },
    {
        "selftext": "AITA so i was chatting with a firend of mine im a teen btw and we wanted to have a laugh so we looked on instagram and found somebody with a funny face so we laughed and then somebody breached my privacy by taking pictures of my chats and now the girl knows and is apparently insecure but she was popular she just wanted to put the blame on me in the hopes of getting detention so i was taken to the teacher he told me that i was the guy thats wrong while they got into my private conversations and took pics i kept saying she breached my privacy this is not right until the teacher started treathining saying youre wasting my time if you want you can go to the principals office and get some detention and work for on the weekend if you dont qay sorry now so i said sorry went to play my chess tournament in school won so im happy now but i dont think these actions by the teacher are wrong treathining like this wont make somebody learn from their mistakes what is y'alls opinion",
        "gilded": 0,
        "title": "AITA bcuz of my chats",
        "upvote_ratio": 0.25,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738871146.0,
        "num_comments": 54,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijbg1t/aita_bcuz_of_my_chats/",
        "num_crossposts": 1
    },
    {
        "selftext": "AITAH/ I have a love hate relationship with my job, when it’s bad it’s really bad and I come home really stressed out and sometimes go mute. It’s a very stressful environment for not being a stressful job because of my coworkers. I come home to try to just decompress to my fiance and now he’s saying that my bad mood is to be expected everyday when I come home from work. He doesn’t work at the moment and so our decompression of our work day aren’t the same anymore it’s just me complaining about my day but who genuinely.. who else am I supposed to talk to? I have friends all with their own problems with work and life stresses but I feel like that’s the only person I SHOULD be able to talk to without shame. Everytime I begin to vent I’m usually cut off with the same responses before I can even finishing venting. And I’m not saying I’m sitting here for HOURS venting about my day I’m talking 20-30 minutes.. and I get told over and over how I need to find a new job when I already am. What am I supposed to do?",
        "gilded": 0,
        "title": "AITA For bringing my work frustrations home?",
        "upvote_ratio": 0.65,
        "ups": 8,
        "link_flair_text": "Asshole",
        "created": 1738884241.0,
        "num_comments": 52,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijgpnn/aita_for_bringing_my_work_frustrations_home/",
        "num_crossposts": 1
    },
    {
        "selftext": "Me and my girlfriend have been dating for a couple months now. I'm always kind to her and try to help her during her period. The other day, when she was on her cycle, she asked me to get her something from the store for her period. I had just gotten home from the store and said, I just went to the store. Can't I deal with your period pop later? She then got mad at me and told me she needed it and that I was rude and disrespectful for calling her period a period pop. I get that I shouldn't have called them a period pop but I wasn't insulting her or anything. AITA?   Edit: Okay I get ITA for calling her periods period pops but am ITA for not going to the store again? Edit 2: I forgot to mention I don’t have a car (I’m 16 years old atm) and I have to walk 20 minutes to the nearest CVS. Although, after seeing this and what other people think, I’ve realized I am the asshole. I shouldn’t have joked about her period. ",
        "gilded": 0,
        "title": "AITA for calling my girlfriends periods period pops?",
        "upvote_ratio": 0.29,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738470225.0,
        "num_comments": 52,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifp4b8/aita_for_calling_my_girlfriends_periods_period/",
        "num_crossposts": 1
    },
    {
        "selftext": "Something you have to know before reading is, I a 17m have a small YouTube channel with my friends where we post us doing parkour. and one of our latest short just hit 1 million views out of nowhere, obviously I was happy and excited and I told my mom and dad since this was fare more views than any other video. A couple weeks later we had to go to a family gathering since it was one of my cousins birthday, whilst we where sitting arround the table drinking hot chocolate and eating lunch  this interaction occurred: Mom: Storm (my name) has a YouTube channelMe: no stop momMom: OkCousin: oh cool what is it calledMe: I don’t wanna talk about itMom: he just got one million views on a videoMe: Mom stop I don’t wanna talk about itCousin: wow Storm you don’t have to be embarrassed that’s cool!Me: I was just on a short it doesn’t matter(Then my mom leans a bit in over the table and places her hand on the side of her mouth so I can’t see her lips and then whispers)Mom whispering: He posts himself doing parkourMe: mom stopCousin: cool don’t be shy about it This was a super uncomfortable situation for me since I already am a bit introverted and don’t like to talk about it which my mom does know. And now after we have gone home I said that it was mean of her to put me in that situation, but my mom still doesn’t think that she was in the wrong. So Reddit am I or my mom in the wrong?",
        "gilded": 0,
        "title": "AITA My mom exposed my YouTube channel to the entire family.",
        "upvote_ratio": 0.34,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738333954.0,
        "num_comments": 50,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ieg2uq/aita_my_mom_exposed_my_youtube_channel_to_the/",
        "num_crossposts": 1
    },
    {
        "selftext": "My dad and I were fairly close even though he lived in another country apart from the rest of the family. He passed away a couple years ago, but there was no love between my parents since I was young - mostly due to the distance and the financial troubles we were in, she blamed him for the lack of support and I grew up hearing them fight constantly. It’s a bit complicated but they remained married still until his passing.  My mom has been seeing this new guy for several years now, and I’ve never met him (she has never asked but it’s not something I would remotely be interested in - her life is her life). I also know they’ve been on/off many times, despite also having gone on trips, etc.  Since it’s my day I’m uncomfortable with my mom bringing him as a +1. I understand that she wants to celebrate her daughter getting married, however there will also be family invited whom she’ll likely need to act as translator for, since they do not speak English and are only flying in for my wedding.  Her argument is also that, since I’m OK with her having invited coworkers and other less-close friends, that her (currently-on) boyfriend is no different and that I am selfish for not wanting him there when it’s “her day too”.  So AITA for not wanting my mom to specifically bring her boyfriend to my wedding, when I’m OK with coworkers/other people in her life?",
        "gilded": 0,
        "title": "AITA for not allowing my mom to bring her boyfriend to my wedding?",
        "upvote_ratio": 0.65,
        "ups": 19,
        "link_flair_text": "Asshole",
        "created": 1738554276.0,
        "num_comments": 43,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igg3d1/aita_for_not_allowing_my_mom_to_bring_her/",
        "num_crossposts": 1
    },
    {
        "selftext": "Ok guys, my (now ex) girlfriend (F18) of 3 years broke up with me (M18) out of nowhere.  She TEXTED me I don't feel anything for you like someone in a romantic relationship would. I think our relationship changed and i lost feelings.  I tried to understand why she lost feelings, asked her what she wanted to do. Take a break? End things completely? She would ALWAYS tell me i dont know.  Every question i asked her she would say that she didnt know. We were in this situation for like 3 days, i wanted answers, a reason why she wanted to leave me, what she wanted to do from here, but i got none.  Eventually i got fed up and told her I need an answer, you cant just fool me around, i deserve to know what you want to do and why you wanted to do it.  Mind you, this is all over text... we live 20 min away from each other but okay. She finally said she wanted to break up because she thinks no one can re-gain feelings for someone which i dont agree but thats not the point. Now that you have a backstory: would I be the asshole if i asked her for some expensive gifts i gave her?  I spent a lot of my money that I made working my ass off in sound and music production. I don't have a stable job, just little ones that i get offered from time to time because im also in college full time.  I gave her a lot of plushies and sylvanian families that she loves, which cost a lot of money... so i kinda want to ask for them back so i can sell them. I dont know if this is an asshole move.  Yes, i will offer to give the gifts she gave me back to her ofc.",
        "gilded": 0,
        "title": "WIBTA for asking for gifts back, after a break up?",
        "upvote_ratio": 0.39,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738715929.0,
        "num_comments": 46,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihxdk0/wibta_for_asking_for_gifts_back_after_a_break_up/",
        "num_crossposts": 1
    },
    {
        "selftext": "For the past two or three years, my roommate and I (both of us are 22M) watch over his nephew (5M) when his mother's at work. Said nephew is obsessed with this Kidoodle app, which contains stuff such as Ryan's World, Baby Shark and Like Nastya. This is something that, while the roommate does find annoying, he otherwise doesn't mind since he's always busy with game modding. However, I've been noticing as of late that it appears the brainrot he's been watching is having a noticeably negative impact on his behavior, especially in school. And I feel like that it's also what's causing his speech learning delay. I had enough of this after a while, so earlier today, I decided to uninstall the Kidoodle app from the TV, and I told him that it had shut down, meaning that those shows were gone forever. Needless to say, he *COMPLETELY* lost it. But I feel that it's for the best. Haven't heard from said roommate yet, as he's been out and about today, but I'm really not sure how he's going to react. So, my question is. Am I the asshole for lying to my roommate's nephew?",
        "gilded": 0,
        "title": "AITA for lying to my roommate's nephew, in an attempt to improve his behavior?",
        "upvote_ratio": 0.47,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738620976.0,
        "num_comments": 45,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih1qzz/aita_for_lying_to_my_roommates_nephew_in_an/",
        "num_crossposts": 2
    },
    {
        "selftext": "My kid told me to post this. My (62, M) wife (62, F) and I got married in our early 20s. Fron the jump, SHE asked me if she could be a STAHM. I was making good money so it didn't bother me, I could support the family financially alone. And I did. My family wanted for nothing. And my wife took care of the home, cooking, cleaning, laundry.  Fast forward to now and we are empty nesters. I still work, I have my own business I'm growing for the last 5 years. My wife takes care of the home. Our youngest child came home to handle some health issues.  My wife took him to the hospital for an out patient cardiac procedure that took all day.  Here's where I might be the AH. I work from home, specifically in the lounge in our building. During the day when my wife and kid was at the hospital, I took a work break. I went upstairs, made myself lunch, then went back to work downstairs. I left the pots and dirty dishes in the sink. So when my wife came home late from the hosipital with our kid still in pain from the procedure, she came home to the dirty dishes.  But washing dishes is her job, that was our arrangement. And I had A LOT of work to do. So AITA? ",
        "gilded": 0,
        "title": "AITA for not washing my dishes?",
        "upvote_ratio": 0.38,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738336987.0,
        "num_comments": 45,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ieh69i/aita_for_not_washing_my_dishes/",
        "num_crossposts": 0
    },
    {
        "selftext": "My sister(30F) just had her birthday and is obsessed with celebrating things now. She had her big birthday 4 day ski trip cancelled because of weather and is pissed because she had been planning it for a while. She made a big deal out of it because in her eyes she never got to celebrate anything. We went for a meal and karaoke but she didn’t feel like it was enough of a celebration.  Tbh our family isn’t big on celebrating anything but my sister kind of brought it on herself. My sister put a lot more pressure on herself when she was younger because everyone told her she was a genius. She skipped grades and graduated high school at 16. She didn’t attend prom because she was younger than the other students so even though she was a senior she hung out with student her own age more so she didn’t have friends to go with. Plus if I remember correctly she had AP exams afterwards so she spent that night studying because at that point she needed an A in every subject. She always says it was her biggest regret in life. Our parents didn’t put that on her she was just over the top back then. I think it’s overblown because she is very successful now in a job that’s hard to get into so it’s not like her hard work wasn’t rewarded. Tons of people work hard without much to show for it which is worse.   She was complaining to me constantly about her 30th being ruined and said she only has her wedding to look forward to now (she isn’t engaged yet but probably will be this year). I told her she shouldn’t put so much on the wedding and it’s just an expensive party which she can afford yes but it’s still a lot to be putting on a single day. She said it’s her last chance to celebrate something and all the achievements she had has been pushed aside to make room for the next thing and she wants her wedding to be memorable like her 30th was suppose to be but in a good way. She mentioned again skipping prom as an example and I told her that skipping prom to study is kind of a humble brag but more so it’s not a big deal. I went to prom and honestly it wasn’t that interesting, I get she missed it and it sucks but she has way better things in life rn. She got mad and said I got a lot more things celebrated than her so I don’t understand what it’s like to go back and realize there isn’t even a single photo of the event. I’ve texted her a few times since and she just replies with one word answers and I just wonder if she’s overreacting or I’m the asshole here. ",
        "gilded": 0,
        "title": "AITA for telling my sister her biggest regret is a humble brag and not a big deal?",
        "upvote_ratio": 0.34,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738886269.0,
        "num_comments": 41,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijhfum/aita_for_telling_my_sister_her_biggest_regret_is/",
        "num_crossposts": 2
    },
    {
        "selftext": "I earned $2,600 through selling from years of gaming, and I deposited it into my bank account. Every week when my parents aren’t home on a day, my brother and I take turns ordering items for three of us (me and my two brothers) using funds our dad gives onto our cards. On top of that, each of us has saved around $3,000 from birthday money saved for future expenses (such as university) I’m considering withdrawing my $2,600 so that if our dad’s money ever runs low, I won’t have to dip into my own hard-earned cash. Since if my brother runs out of money, my dad will just add more money to it. However, my dad thinks I should also consider my brothers’ needs. I’m planning to use this money for an iPad for university— (waiting for an new model is coming out in about 7-8 months) —and I’m worried that if I dip into my own money, I might not have enough left for 10% of the cost of an iPad by the time it comes out. By the way, my dad works extremely hard to get us into private schools and pay houses. He also owns a few small companies, and sometimes he needs to borrow money.  However, I would say we are decently well off and my two brothers recently got the IPhone 16 Pro Max (I didn’t get one, but he offered to one day get me an MacBook to make it even). For university, I would heavily prefer an IPad over an MacBook but I feel like it would be harder without an MacBook, which is why I would wanna take out my own money for an iPad along the MacBook.  AITA?",
        "gilded": 0,
        "title": "AITA for refusing to use my money for family cost? (16, M)",
        "upvote_ratio": 0.36,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738723615.0,
        "num_comments": 41,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ii00ss/aita_for_refusing_to_use_my_money_for_family_cost/",
        "num_crossposts": 1
    },
    {
        "selftext": "So me (18M) and my girlfriend (18F) has been together a just over a year now, and we both have eachothers phone passcodes. Early on in the relationship I've established that I don't agree with obsessing with celebrities or saving videos of someone you find attractive on social media if you have a partner - she agreed and didn't have a problem with this. A couple times however I've found her doing this. One time she thought I was asleep, she was on her phone and I saw she had a bunch of thirst traps saved (all of the same actor). When I pretended to wake up she deleted them as quick as she could which I found very odd, because now it seems she's trying to hide it. That was half a year ago, but yesterday whilst she was sleeping, I went on her Tiktok. Initially I went on it to troll a mutual friend of ours, I was going to send them a silly message but then I saw that my girlfriend had been sending this friend thirst traps of that same actor from before saying things like Silent repost because my boyfriend would be upset or I fear I would fall for this man but don't tell my boyfriend I said that. I felt so disrespected because she's actively trying to hide it, and this is something she KNEW I would be upset by. Anyways, I then went through her favourited videos and as I thought, a bunch of thirst traps and edits of the same guy over and over again. I know people are going to say You violated her privacy, you clearly didn't trust her in the first place but we've given eachother our passcodes so I don't think it's that problematic, she could've gone through my phone too. Let me know if that's a wrong way of thinking. I confronted her and she smiled and laughed and said you've made yourself sad now why would you do that. She saw I wasn't happy and changed her demeanor, and said she didn't know what to say. We talked and I said how I felt betrayed, she crossed a boundary and how I thought it was disgusting that she was fully aware she was doing something I wasn't comfortable with and tried to hide it. We didn't get into an argument, we were laying in bed saying things individually, taking long pauses to think of what to say, no shouting just calm discussion. When she got home, her parents asked why she was upset and she told them the situation but her parents are very angry at me for going through her phone in the first place, and said that I didn't trust her. She also texted me saying she also thought the same thing but didn't want to tell me when we were hanging out because she didn't want to make the situation worse. I haven't told her I wasn't even planning on going through her phone in the first place but rather just wanted to troll that friend of ours. I know that I should've just left it at that and ignored the videos she sent, rather than going through her favourites. I just want opinions on the situation, am I the asshole for having gone through her phone, or am I right in saying she's in the wrong for having crossed a boundary?",
        "gilded": 0,
        "title": "AITA for going through my gf's social media",
        "upvote_ratio": 0.48,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738487353.0,
        "num_comments": 40,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iftej0/aita_for_going_through_my_gfs_social_media/",
        "num_crossposts": 1
    },
    {
        "selftext": "So basically 2023 was a really tough time for me emotionally speaking. My grandpa's brother, who we often visited and had great conversations, died in January. That was a really big factor of my mental state, but there were other factors as well. To summarize, my grades were really bad and I was extremely sad and hopeless for the longest continuous period of time in my life, ever.  So, I decided, for some reason, that I'll talk about my problems in the class group chat. The response was immediately dismissive. The crux was that I didn't know what exactly is the problem, I just knew something is very much off. So my classmates were like Why are you talking about your problems if you don't even know what they are? We can't help you if we don't know what you need help with.    In my messages I would describe myself as having a breakdown/tantrum. And I just want to say, I am aware that just because I was in a tough mental state it doesn't mean I'm allowed to drag my classmates into it and do whatever I want. But overall, this has been on my mind a lot since it has happened, and I just want to know what others think. From both sides of the fence.  Thank you!",
        "gilded": 0,
        "title": "AITA for whining about my personal problems in the class group chat?",
        "upvote_ratio": 0.33,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738509112.0,
        "num_comments": 38,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifz9j2/aita_for_whining_about_my_personal_problems_in/",
        "num_crossposts": 0
    },
    {
        "selftext": "So, this just happened, bear with me while I collect my thoughts.  Today my mother recieved a message from her step nephew. Her brother, my uncle, married a woman who already had 2 kids. He cared for them as if they were his own and we've always been close, even though they live in another country.  The message read something along the lines of Tell your family never to speak to my mother again. You should be ashamed of yourselves. Tell your parents their son would be ashamed of them. We were so confused. For context, we are currently on vacation that my grandparents paid for. Just immediate family, my grandparents, my parents, my brother, my husband, me and my son.  My uncle passed away a few years ago and since then, my mother communicates regularly with my aunt. We face timed her for Christmas. Up until that message, we had no indication anything was wrong. Now my aunt won't answer her calls and her step nephew is refusing to elaborate. Here comes the part where I might become an asshole. My mom has asked us not to tell my grandparents. My dad, brother and husband all know. I know because I was there when my mom got the message. I told my husband and my mom told my dad and my brother.  I think my grandparents deserve to know. I think they could shed light on what happened. My nana talks to my aunt all the time, so maybe something happened? They are napping right now, so it will be a little while before I have the opportunity.  We have speculated on causes but we really have no clue.  So, WIBTA if I went against my mom's wishes and told my grandparents about the message? Update: I spoke to my mom again. All of that side of the family has blocked her on all social media. They have not blocked anyone else, at least as far as I know. My aunt has not blocked or unfriended me, nor has her daughter or granddaughter. I hadn't noticed (I'm not on Facebook much) but the one who sent the message, his wife unfriended me at some point. No idea when. We still don't have an explanation, but I thought you guys might like an update. I haven't told my grandparents, as the consensus seems to be that it's up to my mom. And I get that. For now, as long as she promises to tell them eventually, I'll hold my tongue. Update 2: My mom told my grandparents. They are as confused as we are. They haven't spoken to anyone on that side since about a week before our trip. And it turns out my grandparents were about to send a big cheque. My grandfather has said he won't send the cheque until we get this sorted. My nana is annoyed that they used her son against her for what she perceives as no reason. I think I need to add the context that we live in Canada and they live in the US. And the message came on the day Trump instituted those tariffs. We've always had a difference of politics (they love Trump for some reason) but we almost never talk politics with them. My grandfather thinks they will come around once they realize the money has dried up. Also, they were supposed to send my nana part of my uncle's ashes and they never have. She deserves to have her sons ashes. All of this came out as my nana muttered angrily.",
        "gilded": 0,
        "title": "WIBTA if I told my grandparents something my mom asked me not to?",
        "upvote_ratio": 0.84,
        "ups": 34,
        "link_flair_text": "Asshole",
        "created": 1738441989.0,
        "num_comments": 32,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iffnb3/wibta_if_i_told_my_grandparents_something_my_mom/",
        "num_crossposts": 1
    },
    {
        "selftext": "My fiancée (31F) and I (33M) have a daughter together (2F). My mom passed away in 2020, my dad lives on the other side of the country, and my fiancée's parents both passed away in 2014. That leaves the only grandparent figures to my daughter that live nearby as my own grandparents (69F and 72M), who live about 15 minutes away. My grandma (step, but has been a grandma to me my whole life) has an incurable cancer, and my grandpa has dementia that is early on but progressing. Partly for these reasons, we would like our daughter to get as many memories with them as possible while they're still around and before my grandpa's memory loss becomes severe. There was one time we attempted an overnight stay with them while we were home by ourselves. It didn't go so well; she had a hard time going to sleep and was clear she has some separation anxiety. It wasn't all bad, but clearly something that needs to be worked on.  Ever since, my grandma, who between the two of them is usually the one we talk to and who makes decisions, has been quick to point out examples of her showing separation anxiety when around (which has become infrequent, the last time being on Christmas). When asking if they'd be willing to take her for a couple hours to get some time with her, whether just because or we have something to take care of, she refuses, saying she needs to get over separation anxiety before they can take her again. Our thoughts are that she won't get over it if we don't give her a chance to. And we don't exactly have a village of people able to help with that, as partly mentioned before. Meanwhile, my grandparents frequently watch the kids of my cousin (25F), the kids being 6F, 4M, 3M, and 2F. She is no longer with either of the two fathers and has been known to frequently dump her kids on our grandparents. My grandma has said multiple times after various incidents of disrespect that she will not help my cousin anymore, but ultimately winds up doing so anyway. When we bring up these issues, my grandma claims that because these kids are not well taken care of (sadly true), she needs to keep a closer eye on them; we take this as our daughter being punished for being well taken care of. She also believes they do not have separation anxiety because of the rocky relationship with their mom, so they are more willing to be at their house. She takes our pushing that we accuse her of playing favoritism with the other kids.  We realize that someone has to watch those kids so their mom can work. My situation is more fortunate in that regard as I work while my fiancée is a stay at home mom. But we think there needs to somehow be more balance in the situation. And again, to have my daughter and grandparents to get plenty of time together before it's too late. So... AITA?",
        "gilded": 0,
        "title": "AITA for pushing my grandparents to see my daughter more often",
        "upvote_ratio": 0.5,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738873274.0,
        "num_comments": 36,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijcc19/aita_for_pushing_my_grandparents_to_see_my/",
        "num_crossposts": 1
    },
    {
        "selftext": "AITA for confronting a bully? so me f 15 heard about this kid in my show choir (m 17/18) who was making fun of bigger or different girls by body shaming them to the point where they switched schools or had to be homeschooled so I decided it would be a great idea to CALL HIM OUT right after they performed, I  had said to him ya know I heard you were REALLY mean to people and I  also had ----- tell me you bullied her till she went to a different school his response was immediately defensive telling me I WOULD NEVER BULLY ANYONE EVEN IF I HANG OUT WITH PEOPLE WHO DO so I asked more people in our choir about it and found out that he was mean to bigger people and people who dressed differently also, that he cheated on his girlfriend because she wouldn't do the deed with him. so, AITA for confronting him and possibly hurting his feelings and spreading it around?",
        "gilded": 0,
        "title": "AITA for confronting a bully?",
        "upvote_ratio": 0.69,
        "ups": 15,
        "link_flair_text": "Asshole",
        "created": 1738641480.0,
        "num_comments": 33,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih8zky/aita_for_confronting_a_bully/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (13M) have two friends (13M) that are brothers, of which we have sleepovers often, mainly at their house. They have responsibilities in their household, just as I do. I was taught very good responsibility. More often than not, they are yelled to (as we mostly stay in the basement) to do their chores and other things around the house. As the good friend, I help to make it go faster. But, sometimes they don't listen. When one of their parents yells down the stairs to do something, such as clean the basement, they just completely ignore it. I always listen so that I always know when we are supposed to do something. After 2.5-5 minutes, I tell them that they need to do their chores. And all I get in return? Okay. Ten more minutes, I remind them. Then, they get an attitude. AITA for telling them to do what their told?",
        "gilded": 0,
        "title": "AITA for telling my friends to do what they're told?",
        "upvote_ratio": 0.32,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738797787.0,
        "num_comments": 35,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iio4h1/aita_for_telling_my_friends_to_do_what_theyre_told/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (18F) had a fight with my boyfriend (19M) and I asked for advice from friends. Should I figure these things out myself or is it okay to share the texts with friends? I do this every time I'm confused about the situation were in and I can't figure out if I'm making our problems bigger than they actually are. But every time i confess to my boyfriend that I've showed our chat to our friends he freaks out and says it's an invasion of privacy.  I'm scared that he's using that as an excuse to have an easier time with me.",
        "gilded": 0,
        "title": "AITA for showing my friends my text conversation with my boyfriend to get advice?",
        "upvote_ratio": 0.41,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738635942.0,
        "num_comments": 35,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih77qg/aita_for_showing_my_friends_my_text_conversation/",
        "num_crossposts": 2
    },
    {
        "selftext": " My brother (24M) and I (22F) are living at our parents’ house with two siblings until our finances are sorted. Some of us are learning new skills and breaking into careers while we don’t have to worry about bills. I’ve had issues with my older brother (Jamal, placeholder name) before, but lately, he’s been combative. He talks to our two older sisters behind our backs and seems convinced by them our parents are controlling and don’t want us independent. He’s a pain; he doesn’t say anything bad directly, but he goes out of his way to eat healthily and restrict himself in front of me, making me feel bad about my body and weight. He pretends to be supportive, though. He opens canned beans without our mom’s permission, knowing he’s supposed to ask to avoid a mess. His excuse is he bought it with his own money, claiming he doesn’t make messes (he doesn’t, to be fair). Mom gets mad at me whenever he does this, so I have to tell her, which he doesn’t like since it’s “not my business” and “this is a problem between me and mom, not you.” He does the same with eggs, setting aside food for himself to “save time” while working on other stuff, which is unfair. Again, he uses the excuse he bought it with his money, but if I have no money, I doubt he does either. He eats more food than us, but I get the impression he thinks he’s better than us because it’s “healthy” or he “works out,” spending half his day walking around the house or outside. None of this is good for his mental health, and he never listens to us. After I took a shower, I needed to tell our mother something, so I called her and then yelled her name. Jamal came out of his room, ready to leave, and said, “You don’t need to bother her over the air purifier. I’m coming downstairs; I can turn it off.” I wasn’t asking about that, so I kept calling her and asked him to open her door. He retorted, “What are you trying to pry her off her bed for? You don’t need to bother her over every little thing.” I told him I wanted to tell her something. He opened the door, then walked off. I asked if she was on her bed, and he said no. When I told him to walk inside, he said he had to “be somewhere” (nowhere). I was upset since he knows I’m trying to get her attention, but he does the bare minimum. I laid this out for him and called him weird for that. He cut me off, saying, “Don’t start this with me.” I reiterated everything and insisted he was weird for not helping. He shot back, “You barely help me. You can’t be bothered to throw a potato in the oven while I’m outside helping our pregnant sister. How about that?” I reiterated every issue of his while he walked off, telling me this was “petty and unnecessary” before leaving. AITA  Edit: To clarify, I’m describing how his actions make me feel. He has never outright called me fat; I just don’t like watching him eat the way he does since it makes me feel bad.",
        "gilded": 0,
        "title": "AITA for yelling at my brother because he didn’t help me get our mother’s attention?",
        "upvote_ratio": 0.36,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738608689.0,
        "num_comments": 32,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igwn3o/aita_for_yelling_at_my_brother_because_he_didnt/",
        "num_crossposts": 1
    },
    {
        "selftext": "Hello everyone! Just made an account, so bear with me while I try and type this out well! *Fake Names* My best friend Macy (19) and Me ( 22 ) have been best friends for 11 years. We’ve been a very close pair and never had arguments. I watched her grow up while I grew up as well. She’s always been like a sister to me. I’ve been there whenever she needed me as she was also there for me. A few years back she had moved to Maine with her family and it absolutely devastated us. We would hang out on week days and every weekend together and now having that divide was crushing. We still kept in touch and stayed close, communication just got harder as years went on. She has recently graduated, started college and a job. I am so proud of her for all her achievements, she is one of the smartest people I know. A few months ago she got engaged to her 6 year long relationship with her boyfriend Rob ( 20 ). I was ABSOLUTELY ecstatic!!! To see her beaming for joy was a beautiful heartwarming thing. He proposed to her around all their friends when they went on a camping trip. How cute, right? She face-timed me to tell me and show me the ring. I jumped up and down and squealed for her hahaha. A few months after she was talking to me about plans for their wedding. They decided to hold off until they both graduated college to officially get married. I think that's a very wise decision on their part. After telling me this, she proceeded to say- “Oh btw. Destiny ( 18 ) is probably going to be my Maid Of Honor. Hope you aren’t upset.” I won’t lie, it was like a slap to the face and it did hurt. Her and Destiny became friends when she moved to Maine. They’ve been friends for around 7 years now. It hurt me only because I feel even though she’s been great friends with her, it would make more sense for me to be that since we’ve had a close friendship of 11 years going on 12 now. I didn’t want her to feel I was trying to be an ass or poison the conversation on something exciting, so I kept quiet for now. I waited a month and I couldn’t shake the hurt I was feeling. Since she moved I felt a bit like I was now the “Past” so to speak. I texted Macy- explaining how I truly felt and how I wasn’t trying to create issues, but just voicing my feelings. She told me she was never trying to hurt me but that Destiny just meant a lot to her….but don’t I as well? She told me I could still be a bridesmaid but it was just the bluntness and putting a friend she hasn’t known for as long in that position that truly just hurt me and made me feel off.  Am I the asshole for being upset about this? ",
        "gilded": 0,
        "title": "AITA Because I don’t want my best friend to choose her other best friend to be her Maid Of Honor?",
        "upvote_ratio": 0.33,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738387246.0,
        "num_comments": 32,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iezabp/aita_because_i_dont_want_my_best_friend_to_choose/",
        "num_crossposts": 2
    },
    {
        "selftext": "I (15m) have a friend (16m) yesterday he went on a date. He was complaining to me about his date and how she told him he speaks so good for a deaf person. He was offended bcs apparently that's not a compliment. I was like yeah I mean I wouldn't be offended but you do you He kept going tho and said she also complimented him on his voice and told him she could never tell he was deaf by his voice. At this point it felt like he was low-key trying to brag so I told him dude stop it you don't even sound that good. He asked me wdym and I told him I'm sure she could actually tell he's deaf by his voice but was probably just being kind. He got upset blamed me with being jealous. I had a crush on this girl some time ago. But idgaf about her anymore. I was just annoyed by him humble bragging. I said yeah think whatever you want to, but she prob felt awkward around you and was just tryna be nice and lighten the mood. So quit acting as if she insulted you. He insulted me then told me I'm supposed to be his friend not his enemy. We haven't talked since then. Mutual friends think he was being annoying but I acted like an AH.   AITA?",
        "gilded": 0,
        "title": "AITA for telling my friend he doesn't even sound that good?",
        "upvote_ratio": 0.36,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738610377.0,
        "num_comments": 30,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igxcn5/aita_for_telling_my_friend_he_doesnt_even_sound/",
        "num_crossposts": 1
    },
    {
        "selftext": "Hey all,I was in a bar last week and I was having a good time with a friend. A lot of people interacted with us and we were all having a good time.  There was a moment where a few girls asked if they could sit with us. For context we were are both males. I did not really talk to their group, other than saying hi, and I was speaking to another girl about university and the states. One of the girls from the group, was flirting with my friend I believe and earlier when they first sat down, my friend asked her what she thought of Australia day, and she said Invasion Day... my parents invaded. I understood the banter, but didn't mess with that, so already knew to not engage with them and avoid them. At a certain point I was just sitting with the one girl from the group and myself, as my friend and her's went to get drinks seperately. We started talking about skincare as she saw my lip balm on the table and made a lewd comment about me having it. I told her so you like my friend and she said yeah but was saying what he was wearing wasn't nice. I asked her if she had a boyfriend and she said she was dating a guy, and I asked if her friends had boyfriends and she said yes, and I said oh it's probably best you don't sit with us, but I hope he pleases you (meant it as treats you well, BUT that is a bit weird to say) you and everything goes well. She took offence and said these aren't your seats and said a few rude things I can't remmeber, I said yes but we were here first this is our land, so you can piss off basically taking a dig at what she said before. About 20 minutes later, a member of staff came to me and pulled me aside. They explained I was reported as making an inappropriate comment to a few females and I had to leave. I was taken aback but said yeah of course, because I know better than to argue as it's a strict policy that bars need to enforce. When I was being escorted out I did explain there was a girl I told to girl to kick rocks when I found out she had a boyfriend, although I had been interacting with men/women all night and nobody had complained. I was pretty much sober as I don't like to drink much. The staff that escorted me out apologised and said they felt uncomfortable doing that to me, and I said that they were being professional and it's fine. They said they would love to have me back but as a hard  policy, any complaint is taken seriously. We exchanged names and that was it. I am 99% sure this was why I was kicked out. Whether something was taken out of context is understandable, and to be honest I should have known better to be rude. AITA for telling someone to piss off and getting kicked out, of was this blown out of proportion?",
        "gilded": 0,
        "title": "AITA - Kicked out of bar for inappropriate comment",
        "upvote_ratio": 0.42,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738492661.0,
        "num_comments": 30,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifulkz/aita_kicked_out_of_bar_for_inappropriate_comment/",
        "num_crossposts": 1
    },
    {
        "selftext": "So me and my roommate share a room. Over the weekend, they went home and so did everyone else. I ended up staying alone in the apt, which is normal. The thing is, when everyone is gone and I'm alone in the apartment, I tend to lock the bedroom door bc it makes me feel safer.  Today my roommate was suppose to come back. Well, during the time they were coming back to the apartment, I took a nap after studying for 6 hours straight so i was lowkey drained and completely forgot about the lock door. I'm a pretty heavy sleeper and therefore i did not notice them knocking on the door. They called me once and texted me once but i slept through that. Around 2 hours later, i finally awoken and saw their text. I immediately got up to unlock it and by that time they were hella fricking pissed. I see that I do sound like ah but its not like they were locked out of the apt. idk maybe im overthinking it and i am an ahole. ",
        "gilded": 0,
        "title": "AITA for locking the bedroom door aka locking my roommate out",
        "upvote_ratio": 0.61,
        "ups": 5,
        "link_flair_text": "Asshole",
        "created": 1738554572.0,
        "num_comments": 29,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igg6n1/aita_for_locking_the_bedroom_door_aka_locking_my/",
        "num_crossposts": 1
    },
    {
        "selftext": "Pre-COVID, I (31F) was a bridesmaid for my cousin, Diva (34F). Everything was going smoothly until a few weeks before the wedding. Being artistically inclined, I offered to design her wedding invitations as a gift but made it clear I couldn't produce them myself due to financial constraints, as I was handling my mother's medical bills and our family dog's medication for his heart condition. To provide context, I'm an only child caring for a senior citizen (my mother, who is over 70 years old and a cancer patient) and our senior dog. As the wedding planning progressed, Diva approved my designs with some revisions, and I happily submitted them. However, when the actual invitations arrived, they weren't my designs. This was heartbreaking because if I had been informed that my design wouldn't be used, I would have been fine with it, but no one told me. I let it go and moved on. Regarding the pre-wedding parties, I couldn't attend due to my mother's and our dog's medical conditions, which Diva knew about for months and years prior. Despite this, Diva was upset. I couldn't leave my mother, as there was no one else to care for her, nor could she handle our dog, who needed medication and could be aggressive. Hiring help was also not an option due to financial constraints. The Maid of Honor (MOH) got involved, and I kept asking for consideration due to my family responsibilities. The whole family knew about my mother's condition, and some knew about our dog's condition, but I was told I wasn't fulfilling my bridesmaid duties. I had already designed the invitations and helped with bridesmaid dress choices, but I couldn't attend the pre-wedding parties. This led to a feud among the cousins and eventually reached our parents. Days before the wedding, I was still trying to be a good bridesmaid. Hair and makeup were scheduled for 3 AM, but with my responsibilities, I couldn't leave home at 2 AM. I offered to do my own hair and makeup and even negotiated to arrive before the wedding started, prioritizing the ceremony. However, they wouldn't compromise, so my mother and I decided not to attend to avoid further drama. In hindsight, it was a blessing in disguise because our dog passed away on the wedding day, and we were there for him when he passed.",
        "gilded": 0,
        "title": "AITA for backing out on my cousin's wedding the day before?",
        "upvote_ratio": 0.44,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738822503.0,
        "num_comments": 29,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iiw1sk/aita_for_backing_out_on_my_cousins_wedding_the/",
        "num_crossposts": 1
    },
    {
        "selftext": "I was recently out late night to party with my friends. We found this fancy pub which attracts a lot of tourists - I’m not one as I’ve been in this country for more than a year now. I’m an expat, Asian (brown). We decided to enter the pub. The bouncer was standing right in front of the entrance. I saw him and made a small head nod with a smile proceeding to walk past (which I do usually with no issues at all, kinda always felt like a bar/pub code) while he was parallely saying something to me in the local language which I don’t speak. Note - he didn’t block the way by any means or hand gestures or there was no queue. In a second, I was aggressively pulled from behind, he snatched my backup and shouted with anger along the lines of “YOU DON’T WALK BY WHEN I’M TALKING, YOU DISRESPECTED ME, THIS IS MY PLACE AND YOU ARE NOT ALLOWED”. I was shook by this manhandling incident and apologised to him that I didn’t understand the language and not meant to disrespect him by any means. He furiously said, it doesn’t matter and I’m denied access. I apologised and returned. Firstly, it’s not a local pub, the name is evidently common across many countries and it attracts tourists - why communicate in a local language? Second, even if that was a miss from my side to not attempt to understand what he was saying or informing him I don’t speak the language, was his behaviour justified or AITA? Note - I was not super drunk or unstable or alarming by any chance, also had a decent outfit for a pub and was let in with a smile by the other bouncer in a different pub. Edit - I went through the reviews of this pub in internet and the bouncers are known for their notorious racial discriminations so it’s not a me issue. But nevertheless I will not play the racist card here, because I did misunderstand his communication as an invitation/greeting due to my lack of attention/language barrier. I’m pretty sure I’d have got a different treatment if was not brown after reading the reviews.",
        "gilded": 0,
        "title": "AITA for walking past a bouncer while he spoke in a language I don’t know",
        "upvote_ratio": 0.52,
        "ups": 1,
        "link_flair_text": "Asshole",
        "created": 1738525495.0,
        "num_comments": 28,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ig5qcy/aita_for_walking_past_a_bouncer_while_he_spoke_in/",
        "num_crossposts": 1
    },
    {
        "selftext": "I'm 20F, my boyfriend is 23M. We've been together two years and live together. A few months ago, we were about to get evicted because we couldn't pay rent. He were working overtime, but it wasn't enough, and I couldn't find a job that paid enough to help. We didn't have family to bail us out, so I was desperate. had already talked with my bf about if I should but I made it seem like a joke. He told me flat out he didn't want me doing that and was super stern about it. So when I did start selling I didn't tel my boyfriend because I knew he wouldn't be okay with it. But I didn't see another way to keep us from getting kicked out. For a few months, I told him my aunt sent me money to help with rent. He believed it and was really happy but last night he went through my phone and found out. We've been arguing about it all day and I feel terrible. He got really mad and said I betrayed his trust. He said I should've talked to him instead of doing it behind his back but if I talked to him he wouldve never let me. I get why he's upset, but I feel like I didn't have a choice. I don't make a crazy amount of money but it's just enough so we van afford our expenses. He said he wants me to stop posting but 1 think should keep posting until were at a better spot. 1 wasn't trying to hurt him or be sneaky I just didn't know what else to do. I know it wasn't the best move, but I didn't know what else to do since we were stuck. Was I wrong to do it behind his back, or was it kind of justified because of the situation?",
        "gilded": 0,
        "title": "AITA for selling pictures of myself behind my bfs back?",
        "upvote_ratio": 0.32,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738487506.0,
        "num_comments": 28,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iftfqu/aita_for_selling_pictures_of_myself_behind_my_bfs/",
        "num_crossposts": 1
    },
    {
        "selftext": " Recevtly at a family dinner, I brought up Easter and my mother said that  “Me and (oldest brother) will be in the UK then” This trip is for his graduation, and I completely understand that. When I graduate I’ll be going overseas for a few weeks as well. But the problem is that my mother purposely planned the trip so they’d be away during Easter.  I’m an older teen, so this isn’t that big of a deal for me, but my younger brother is still a kid and always gets excited around the holidays. Also, every holiday is a family event and we always spend them together, celebrating and what not I wish I could say this isn’t a babb  it but my mother has always favoured my oldest brother. It’s always been frustrating, but it’s never gotten to the point where she’s purposely flying into a different country with him to celebrate a holiday alone.  It became a problem and I told my mom she was being unfair to her two other children who expected to be to father for the holiday. I told her it was clear she cared more about (oldest brother) than me and (younger brother), and that she and him were being selfish bitches.  My mom said that j was being self centred and ruining her and (oldest brothers moment) and he said that j was trying to ruin his trip because i was jealous I don’t think im the asshole, but they both sah that I’m being ridiculous and selfish. Am I the asshole? ",
        "gilded": 0,
        "title": "AITA for telling my she doesn’t care about two of her kids?",
        "upvote_ratio": 0.42,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738842641.0,
        "num_comments": 25,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij0r74/aita_for_telling_my_she_doesnt_care_about_two_of/",
        "num_crossposts": 0
    },
    {
        "selftext": "im feeling quite shitty if you couldn’t tell. moving away from home for the first time really brings to light which people you genuinely love the company of, and which you kept around for convenience. as much as i really fucking hate to admit it, one of the people in the latter category is my dad (41M). i’m (19F) a university student. my parents have been so unbelievably supportive throughout the entire process, including financial support. i WFH for my dad’s company to earn a bit of money from him, and then my mum sends me a small bit of her wage every month. needless to say, im infinitely grateful. but while i am, i’ve never exactly felt all that close to my dad, and it feels like we’re only growing further apart. my mum is literally my best friend. i call her every day, i tell her almost everything going on. she does the same in return, and checks in all the time. in contrast i text my dad about once a week at best. i’ll always be the first to admit part of this is resentment. my dad had a lot of mental health issues when i was growing up, especially with my parents raising me young, and while i sympathise with him as someone who struggles mentally myself, it kind of made him absent. he was the one who worked all the time to provide for us but he hardly ever *parented* me, i suppose, until i was about 13. then there was this big scandal — you could say — when i was 17 that changed my entire perception of him. i wont go into details, but it was what made me so resentful, and it’s been an elephant in the room since. neither of us have ever initiated a conversation about it, and out of pettiness, part of me doesn’t want to. so nowadays most of the reason i have to text him is if i need something. if i need to borrow a bit of money (he makes a lot more than my mum), if i need a lift somewhere (he drives, my mum doesnt), things like that. it always makes me feel awful because i know i probably owe it to him to chat with him the same way i do with my mum. i just feel this constant emotional disconnect where i either dont even think to do so, or i cant think of a reason why i should have to. sorry for so much text, i just really wanted to get my feelings across. i feel awful and guilty about it all the time. am i the asshole?",
        "gilded": 0,
        "title": "AITA for kind of using my own dad for money?",
        "upvote_ratio": 0.44,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738804432.0,
        "num_comments": 24,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iiqht3/aita_for_kind_of_using_my_own_dad_for_money/",
        "num_crossposts": 1
    },
    {
        "selftext": "So for context I'm autistic and am extremely sensitive to light (like, I get migraines from sunny days). One of my housemates really likes ambient lighting and I've had to ask her to take a motion sensor light down in the hall and on another occassion she took another light down after I suggested a compromise. So now in our living room she's put 3 lamps which are just exposed, high strengh lightbulbs (with no shades). To be fair I almost never use the living room, in part because of anxiety but also in part because our other housemate (who is now moving out) has anger management issues so it wasn't a great vibe. But I was hoping to actually socialise with the new housemate who I have mutual friends with. I also had to take my migraine meds when she left the door to the living room open with one of the lights on but tbf she's now moved it out of view from thedoor. WIBTA if I asked her to get rid of the lamps from the living room/move them to her room? I think I might be TA because I've already asked her to remove lights from common areas, she's spent money on them and has them in a room that I barely ever use. Edit: So for info I'm not against any light, in the previous situation I just asked to have the overhead light on instead as I can just wear a cap. But I see that people are right that I am/would be the asshole, thank you for the feedback. ",
        "gilded": 0,
        "title": "WIBTA for asking my housemate to get rid of her lamps?",
        "upvote_ratio": 0.48,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738334843.0,
        "num_comments": 23,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iege1r/wibta_for_asking_my_housemate_to_get_rid_of_her/",
        "num_crossposts": 0
    },
    {
        "selftext": "First, some background information: my(23F) (not by blood) Aunt's son got married two days ago in Jamaica. Let's just say Sharon(Aunt) lives comfortably. Sharon and her husband(Vlad) rented out almost the whole resort and paid for a villa for me and my parents to stay in. This villa had a pool (all to ourselves!!) and two separate mini buildings, one for living and one for lounging. This wedding was VERY extravagant with a lot of Vlad's business partners. Their business social life is the type where you are drunk all day making fun of people; each business associate was pretty fat with a wife who had crazy Botox and plastic surgery. After the beach ceremony, we were escorted to a dining/dance space where lots of speeches were given. One of the speeches was given by a business associate's wife(who fits the beauty standard explained above). Her speech was pretty unremarkable, and I wasn't paying much attention until she mentioned Sharon's Son's help with her business called Blackwater. I'm not sure if she made the connection to the infamous mercenary firm, but it made me *almost* laugh, I held it in UNTIL she proceeded to explain what her company was about: water with minerals in it, making it black. Basically, it was dirt water that cracked me up like crazy, and I couldn't hold it in. The room was completely silent before this, and everyone's heads whipped towards me. The speech went on, but it was very awkward. After we finished dinner I was pulled over by Sharon who scolded me for laughing and said that everyone was asking her who I was and why I laughed. Apparently the girl felt very embarrassed and self-conscious after I cracked up. People have been treating me like a pariah ever since. 1. AITIA for cracking up during the wedding speech that mentioned dirty water?2. Should I apologize for her or let the dirt settle? (Get it?)",
        "gilded": 0,
        "title": "AITA About Cracking Up During a Wedding Speech That Mentioned Dirty Water",
        "upvote_ratio": 0.41,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738706772.0,
        "num_comments": 21,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihtym2/aita_about_cracking_up_during_a_wedding_speech/",
        "num_crossposts": 2
    },
    {
        "selftext": "Context:- I(22,M) took a small amount of money maybe like 10$ from my friend last year. It was a very minor affair like just paying somewhere when i left my wallet in my car type thing. I meet him everyday. I earlier forgot to repay him but i remembered maybe like 7-8 months ago but since then i have been too ashamed to return the money because it was too late since i took it. Idk i kind of feel bad for him too but also i kind of feel maybe its a small amount so leave it. He is from a well to do family. I don’t think he would mind such a small anount but this is my persona thats making me feel bad",
        "gilded": 0,
        "title": "AITA for not returning small amount of money to my friend",
        "upvote_ratio": 0.25,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738815007.0,
        "num_comments": 20,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iitxnb/aita_for_not_returning_small_amount_of_money_to/",
        "num_crossposts": 2
    },
    {
        "selftext": "I (19F) am at a crossroads with my roommate, Ava (19F), who has been my best friend for two years. When I was given the opportunity to live rent-free in a family-owned apartment (as long as I found a roommate to pay a small rent), I chose Ava over a few other options because we were closest at the time. At first, things were fine, but now I feel suffocated. She constantly interrupts my study time, pushing me to play video games or chat despite my boundaries. I’m an extrovert, but after long days at school, I crave alone time. When I retreat to my room, she knocks, saying she feels lonely and wants to sit on my floor, staring at me or talking about her day. I don’t have the backbone to say no, and she pushes back when I try.  Enter my other best friend, Erica (18F), who I’ve known since we were 10. She’s introverted, incredibly kind, and planning for med school, meaning she’s highly study-oriented. She currently lives in expensive student housing but plans to move home next year, which would mean a brutal 1-2 hour commute. If I had chosen her as my roommate originally, she would have benefited from the affordable rent.  Recently, Ava’s parents offered her a free apartment near campus. I was thrilled for her and saw it as the perfect opportunity—she could save money, and Erica could move in, improving her living situation. I told Erica it was a possibility, and she was excited. However, Ava just told me she’s staying because she’s comfortable here and doesn’t want a new roommate. When she told me, I couldn’t hide my disappointment. Now Ava keeps saying it’s my fault for getting Erica’s hopes up and insists I just want to replace her. But I truly think this move would be better for everyone—Ava could grow more independent, save money, and Erica wouldn’t have to commute for hours. I feel like Ava is holding onto me too tightly, and I don’t know how to navigate this. So, Reddit, AITA for wanting my roommate to move out?",
        "gilded": 0,
        "title": "AITA for wanting my roommate to move out?",
        "upvote_ratio": 0.84,
        "ups": 11,
        "link_flair_text": "Asshole",
        "created": 1738869186.0,
        "num_comments": 18,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ijann7/aita_for_wanting_my_roommate_to_move_out/",
        "num_crossposts": 1
    },
    {
        "selftext": "This may be kinda long so I apologize in advance. So for some backstory my girlfriend has a friend (Sarah) who had a roommate (Cate) living with her and she had a cat there that she left. Eventually Cate moved and abandoned the cat basically leaving Sarah to take care of the cat for months by herself. I heard many bad things about Cate and her cat but that's just what I heard anyway; I'm at a party with my girlfriend and she's with the lady's in a room when she come into a different room with me and the guys saying that Cate said the cat was pregnant then threw that cat and said she didnt want her anymore! I wasn't there but I believe her when it comes to stuff like that she had a cat for 14 years and she's very passionate about animals. The next day Sarah calls my girlfriend and says the cats throwing up and unfortunately had worms and wasn't pregnant. So Me and her take the cat to a shelter because we can't afford to do the surgery and all that but wanted what's best. Now I'm adopting the cat but Cate is now looking for it claiming she wanted the cat. Am I in the wrong for kidnapping this cat? Sorry for the long post and it may not be the best it's my first. Edit 2: incase I wasnt clear Me, my girlfriend,  and Sarah talked about taking the cat up for Sarah when we heard it was sick. We didn't just straight up steal it but in this context yes it's stolen  Edited namesAlso names changed obviously for privacy reasonsTldr Friends roommate abused cat (allegedly) and we took her so the cat stays safe.  UPDATE: I HAVE DA KITTY!! She's doing much much better now and she's become a huge cuddlebug:p Still recovering from surgeries and stuff but she's much happier! Thank you all for your feedback and if anyone is interested I can update on the kitty.",
        "gilded": 0,
        "title": "AITA For catnapping a cat from someone abusing it",
        "upvote_ratio": 0.79,
        "ups": 10,
        "link_flair_text": "Asshole",
        "created": 1738297867.0,
        "num_comments": 19,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ie6ti8/aita_for_catnapping_a_cat_from_someone_abusing_it/",
        "num_crossposts": 0
    },
    {
        "selftext": "Me (17F) and my best friend (18F) have known each other since we were just kids. The problem starts in the pandemic when we both started to have serious issues with self-destructive behaviour.Since last year I have been improving greatly and I think I’m finally healing, but my friend doesn’t seem to want to get on the same path as me. I respect her choices but I really want to help her and it breaks my heart to see her like this, knowing that having her around always slows down my healing journey.Last month, she went on vacation and told me she ordered a package online and sent it to my house (without asking me) and I said it was fine. When it arrived, I stored it in a box under my bed. Some weeks pass, she comes back from her trip and messages me to hang out. She specifically asked me to bring the package, and I thought it was weird but didn’t think too much of it. As I was packing some stuff to bring to her house, I opened the box under my bed and noticed the package wasn’t there. My parents called me downstairs to talk and my dad told me he knew what was inside the package. It was something that could really harm her, and I had no idea. I explained the situation to my parents and thankfully they believed I had no idea about what was inside and I thought I was doing my friend a favour. I started to really think about it and I got really sad at the thought of having helped her smuggle the package behind her parents’ backs. I asked my dad for the package and threw it in the trash before going to my friend’s house. When I arrived, she asked me for the package and I told her what happened. She seemed angry at me and was really quiet through our hangout. I asked my mom to pick me up early, and when I got to my house today, she bombarded my phone with messages saying her package had costed her a lot money and demanded I pay her what she spent or buy her the exact same thing she had bought. I’m not really in a good financial position because I’m saving up for my own education—her family is much richer than mine and her allowance is about three times more than mine—and I didn’t want to spend money only to buy her something dangerous behind her and my parents’ backs. I refused to pay, but that only upset her more. Am I the asshole? ",
        "gilded": 0,
        "title": "AITA for throwing away my friend’s online package?",
        "upvote_ratio": 0.35,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738606804.0,
        "num_comments": 19,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igvuo2/aita_for_throwing_away_my_friends_online_package/",
        "num_crossposts": 1
    },
    {
        "selftext": "1 (21 Male) and my friend (23 Male), let's call him Jacob are both trying to make it as content creators. We both recently found our niche and audience and have been growing in views in views and followers. What kicked this off was Jacob using a trending audio that sky rocketed his views. I made similar videos (never with the same audio) about the same topic because he and I were really well versed in it. Since his initial video blew up he made numerous other videos with that same audio. All of which preformed well. We both supported each other tremendously and always helped each other with videos whenever we could. Our videos went from 200-500 views to 10s of 100s of thousands. This was big for us as we had been trying to reach an audience for a couple years. But It all changed overnight. One day whole brain storming video ideas, I became inspired but my friends video and decided to make a video using the audio and format from his initial post that blew up. I was excited to tell him about it and show it to him before posting. That night while we were gaming I told him about my idea. His mood instantly changed and I could tell he was bothered. He flat out told me that I was stealing his thing. He asked me if I told you not to post that you wouldn't post it right? To which I replied no. As much as I love Jacob I was never gonna let him dictate what I do and don't post on social media. As in the past he has tried to be rather controlling of myself and other friends. He tried telling me that audio is my thing in this community and you're basically stealing my ir I told him that's how trends and social media works. One person makes something and everyone else copies. He kept calling it my audio when he wasn't even the one who created it. He followed a similar format to everyone else who used it, just specific to our niche. There was a lot of back and forth of him telling me not to but me standing my ground. I went as far as saying “nothing bad can happen to you if I post this” to which he said “you don’t know that” He wouldn't budge and said straight up I don't want you posting that. It's my thing. I told him I'm sorry but no, you're not gonna dictate this. At the end of the day I didn't end up posting the video, mainly because I was never going to prioritize social media over our friendship. He got off the game when the conversation ended. We still send each other posts every now and again but we haven't had a conversation since then. So am I the asshole for not taking down my post because my friend told me to.",
        "gilded": 0,
        "title": "AITA for not taking my social media post down after my friend asked me to",
        "upvote_ratio": 0.32,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738648725.0,
        "num_comments": 18,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihb1tv/aita_for_not_taking_my_social_media_post_down/",
        "num_crossposts": 1
    },
    {
        "selftext": "My nephew (18M) is a a senior in high school. An important context to know is that he is bisexual, as this plays a role in the story. He is best friends with a freshman which I will call Jake (15M). Jake and my nephew have been best friends since the beginning of the school year. They hang out frequently and tend to call everyday to play games. My nephew is bisexual and he rarely discloses this information except people he trusts, like Jake. I was informed by my nephew that Jake's friend, Danny, has spread fear and disturbing rumors about their friendship. My nephew told me that Danny and Jake are in a turbulent spot with their friendship, therefore things have been heated between the two. So Danny has taken note that my nephew and Jake are close buddies, and has projected his anger on my nephew to spread libel about him.  Danny, Danny's mom, and Jake's mom are all linked together like espionage. While Danny and Jake were fighting, he secretly hijacked information between Danny and my nephew's friendship. Please note that Jake and my nephew are not romantically involved. So Danny's mom saw my nephew and Jake riding on an electric scooter together, which she has blown out of proportion in the context that my nephew and Jake are in a relationship. Then, my nephew told me that Danny came to the conclusion he is gay because of a joke Jake made while they all had lunch together. Danny has communicated with his mother in malice of my nephew, and spreads fear about my nephew's sexuality to Jake's mom. Jake's mom and Danny's mom are best friends, and have been in communication about this. Now, Jake's mom is accusing my nephew of grooming and influencing Jake to identifyas LGBT. My nephew has NOT DONE THAT. Now, my nephew and Jake have a strained relationship because his parents banned Jake from speaking to my nephew due to these horrific rumors. Even though my nephew is an adult, I feel like I need to take this to the school. I want to confront the parents for overdramatizing and hijacking information about my nephew's sexuality. With the fact he is 18, I fear they could exacerbate it considering the political climate in the US. WIBTA?",
        "gilded": 0,
        "title": "WIBTA if I reported a family who is slandering my nephew?",
        "upvote_ratio": 0.48,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738632333.0,
        "num_comments": 18,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih5z4d/wibta_if_i_reported_a_family_who_is_slandering_my/",
        "num_crossposts": 1
    },
    {
        "selftext": "I met my ex (35F, Mandy) when I (36M) was fourteen years old. We had a teenage romance in early high school that eventually became an on-again-off-again thing in our twenties before finally completely dissolving at around my thirtieth birthday.  We did briefly get married shortly after college graduation so that she could get on my health insurance, but we were living separately at the time and even dating other people.  Because we've known each other for so long, we'll still get coffee or talk over Zoom 4-5x a year to catch up, but the romantic part of our relationship has been completely buried for close to over a decade. And when I say buried, I mean completely gone. Not even a little spark. We've lived across the country from eachother for about five years now. The meetups are mostly talking about life and work shit and the occasional reminiscing. I'm reluctant to give them up because, gloomily enough, Mandy and I are the only two people from our original friend group that are either still living or talking to eachother. I've been with my current wife (38F, Sam) for around six years. She knows about my conversations with Mandy, and she's given her approval, but I can tell the approval has been given reluctantly.  I love my wife to death and I don't want to make her feel uncomfortable, but I also don't want to lose this connection to my past. WIBTA for continuing this platonic relationship with my ex?",
        "gilded": 0,
        "title": "WIBTA for maintaining a platonic relationship with my ex?",
        "upvote_ratio": 0.5,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738525773.0,
        "num_comments": 17,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ig5u9p/wibta_for_maintaining_a_platonic_relationship/",
        "num_crossposts": 1
    },
    {
        "selftext": "If you live in Ontario, you know about Doug Ford’s bribery cheques. (At least that’s what my parents call them.) If you don’t, here’s a quick rundown, basically Doug Ford is sending $200 to every citizen of Ontario, by mail, as a way to convince them to vote for him.  Today, my older sibling (23 NB) got their bribery cheque in the mail, my parents still haven’t gotten theirs and so it became a topic of discussion between my dad and I.  My dad mentioned that in his and my mom’s bribery cheques is also money for me (nearly 16 F) and so naturally I asked to have access to this money, and my dad said no. I then messaged my mom as she’s usually the more reasonable of the two, and she said that because I don’t pay taxes it’s not actually my money.  My birthday is in less than a month and because it’s my sweet 16 I’m planning to go all out, my mum knows this and I said that this money would make everything so much easier for me as I’m paying for my entire party out of pocket, she said “exactly because we pay for everything it’s our money.”  Imo, the least they could do is keep the money for when I’m 18 and actually do pay taxes. Maybe I’m just understanding wrong but my dad literally worded it as “money for you” that they just won’t give to me.  AITA?  ******EDIT*******  Thank you to everyone who responded and helped me see how I was in the wrong, I misunderstood because my dad had said that it was my money, I messaged my mom and apologized to her. ",
        "gilded": 0,
        "title": "AITA for wanting the money from my parents’ bribery cheques",
        "upvote_ratio": 0.27,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738361533.0,
        "num_comments": 17,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ieqvwi/aita_for_wanting_the_money_from_my_parents/",
        "num_crossposts": 2
    },
    {
        "selftext": "Okay so. At school I have this one particular friend. This friend I’ve known since last year but we started to be closer friends this year being my senior year, but for some reason I don’t know how I never noticed but this friend smells absolutely terrible. I try to warn him about this because I don’t want him to get made fun of by other people but he doesn’t believe me because the only people he hangs out with are “weird” kids who I am kind of forced to be friends with because I’m friends with him. And those kids do NOT fucking shower and don’t care about hygiene enough to tell him. I try to assure him I’m not lying and tell him in private so I don’t embarrass him but it just never changes, he lies and says he cleans his clothes everyday but he wears the exact same thing every day. He isn’t financially unstable or poor either, he is able to afford a lot of things I’ve seen in the past. He just genuinely doesn’t believe he smells bad. I feel as though being around him kind of harms my reputation because people will assume it’s me who smells but it’s really him, and I feel like such a dick sometimes for trying to be blunt and honest with him but it is to complete deaf ears. What’s worse is that every morning I sit in this specific spot where I enjoy my personal time before class, but this year he found my spot and there followed all the other kids who also act odd. I started distancing myself from him and sitting in different places trying to avoid him because I genuinely cannot bear the way he smells and the people he brings along. And I’m not just hating on the people he brings because they’re “weird”, they are actually horrible people who constantly talk crazy amounts of shit about me and contribute to rumors spread on me, and whenever I tell them it bothers me they look at me as if I’m fucking weirdo. Also I was planing on asking out a girl who sits near the place where me and him sit, and for some fucking reason whenever I tell him about this he snaps back and looks dead at her and says “WHO HER?”, this was my final straw that made me decide I am done spending time with this guy. I currently sit in a different spot in the morning and I try to tell him it’s for a different reason but he genuinely will not stop talking to me at every opportunity and I just told him one day “Bro you smell like fucking shit please stop talking” and he looked at me crazy. I dunno, am I the asshole for this? ",
        "gilded": 0,
        "title": "AITA for trying to avoid my friend cuz he’s weird and smells terrible?",
        "upvote_ratio": 0.71,
        "ups": 6,
        "link_flair_text": "Asshole",
        "created": 1738636343.0,
        "num_comments": 15,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih7cja/aita_for_trying_to_avoid_my_friend_cuz_hes_weird/",
        "num_crossposts": 1
    },
    {
        "selftext": "Okay so some background, I am a female high school student and I am dating a boy in high school as well. However, we go to different schools. This Saturday he has his snowball dance and 3 weeks ago we talked about it and mutually decided we’d go to my schools because he didn’t wanna go to his and he thought mine would be more fun so I agreed. I wanted to go to both but didn’t push because I didn’t want to make him do smth he didn’t want to. I figured it wouldn’t be an issue. A few days ago he asked what day my dance was on and I told him “it’s in two weeks” and he said “oh okay cool because my friends just invited me to go to my schools dance and stay the night at his house.” And I got a little hurt and said “why are you going? I thought you didn’t want to because it was lame…?” And he said “well I just got invited and I think I’d be fun with my friends.” and we js left it at that. Today, the topic was brought up again and I told him I was uncomfortable with the idea because there are quite a few girls at his school that I’m very suspicious of, there is a girl he’s friends with who is going, and it was weird to go to a school dance with your friends when you have a gf. He told me I was being paranoid and he wasn’t gonna cheat and he js wanted to have fun with friends. I told him I was fine with him hanging out with his friends but maybe in a setting I was more comfortable with. He said I was being dramatic and it was js an innocent hang out, I told him it was weird to go with your friends and he said “everyone went with each other last time” and I told him “yeah that’s bc they don’t have gfs” and he got all annoyed. I’ve talked with 4 of my good girl friends, 1 male friend, my brother, my parents, and a family friend and all of them think it’s a little odd. I tried explaining my whole side of things and how I would prefer if he skipped so I’d be more comfortable and he just told me girls don’t like him, he’s not interested, and I’m being annoying and pissing him off because he just wants to hang out with his friends. I know this is very stupid and trivial, but these are my issues and I’m only in high school once. Let me have little problems now. Am I the asshole for arguing with my bf over this? Edit: On Wednesday he said he would go to my basketball game and then backed out last minute (like an hour before) and told me he’d hang out with me Friday and Sunday to make up for it. I got a text yesterday (Thursday) where he told me he was also spending the night with his friends on Friday night. I got upset and told him that was going to mess up our plans and he got mad at me and said he never does anything with them and he wants to see them. He has a sleep over with them every 2 weeks and when I want to do things with friends I never can because I’m cancelling stuff to be with him. I’ve had people over in October and that was the last time that happened. He ended up breaking up with me because I’m too controlling, according to him. Everyone I’ve talked to thinks that yes I should’ve handled it better and shouldn’t have gotten as upset as I did, but I also explained to him that I wasn’t telling him he couldn’t see his friends but that I was upset that he planned over our previously made plans. He disregarded what I said and how I was feeling. Everyone he talked to about it told him it was extremely impulsive and that he should’ve thought about it more. I skipped school today because I am absolutely devastated. His friends are all trying to talk sense into him and say he’s crazy… I don’t know what to do now…",
        "gilded": 0,
        "title": "AITA for arguing with my boyfriend?",
        "upvote_ratio": 0.21,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738810950.0,
        "num_comments": 14,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iiso70/aita_for_arguing_with_my_boyfriend/",
        "num_crossposts": 1
    },
    {
        "selftext": "For a little context I met my BF in high school. We dated off and on early in our friendship but over the past 12 years aside from a short Covid fling we’ve been solid long distance buddies. There was a discussion about moving in with BF in their town to restart my life. BF always thought I should get out of my old city. I said no that I couldn’t live in a small town. Last year BF brought it up and told me that was an ask to try to get back together. This has been in the back of mind, but I never acted on it. Well over the past month BF returned into my life full time for a bit. First was visiting parents and secondly we planned a cruise in my friend group. I started catching feelings during the time we hung out. It fully set in over the cruise. Not sure exactly what I was feeling at that time, but I figured I had time to sort myself out. Turns out one of the people(NG) we met on the cruise made a huge impact.  What was supposed a short stay at the beach post cruise with three friends left over turned into a scene out of a romance movie that would have the whole dinner table turning heads to listen. My other friend and I became background characters to GF and BFs vacation. It had classics like a spontaneous a road trip and sleeping on the beach. I did not handle it well. The first few days BF noticed and pointed it out. I confessed after some prodding and BF was very nice about it. GF listened to me babble and made sure I was ok. That bit of honesty, however, unleashed a torrent of emotion I didn’t know I had. I became a vacuum of negativity. It got worse as I literally had front seats to their growing flirting, whispers and lack of presence to others in the group.  The lowest was when BFs new partner tried to warm up to me and give me “we can talk about anything that’s bothering you” line. Having the person who swept your crush off their feet try to console you is a torture fit for one of the nine hells. The last night before we all flew back my BF decided to ditch the group for hankey pankey while we were on the understanding that we would hang out before going our separate ways. Radio silence till 7am next day. When they got back I lost it and said things about BF being selfish and making the whole trip about themselves, rubbing their relationship in everyone else’s face until they couldn’t be bothered to have is around. Couldn’t show some restraint for a few days? There was a “sorry you felt that way” apology. I shut down and left for the airport by myself in the morning as BF and NG shared a shower in our hotel. I got a tearful phone messages saying that BG doesn’t want to lose me and that I can take my time to pieces things, but no apology. I’ve blocked her, for my own sanity but I felt disrespected. I probably should have said something earlier. Maybe never say anything at all and pack it down. Crush or not I find it hard to see me as the asshole here for expecting some restraint. I’m pretty sure I’m the asshole, but how big am I?",
        "gilded": 0,
        "title": "AITA for telling off my best friend/crush",
        "upvote_ratio": 0.67,
        "ups": 5,
        "link_flair_text": "Asshole",
        "created": 1738373767.0,
        "num_comments": 14,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iev9aa/aita_for_telling_off_my_best_friendcrush/",
        "num_crossposts": 2
    },
    {
        "selftext": "Before diving into the problem that happened last week, I need to do some background from previous years. I'm 25 (M) have been playing RPGs with my friends for a long time (about 10 years together), we've tried many systems, books and even made our own RPG (it didn't work out as intended). Around 2020, the pandemic hit my country and my schedule changed, because of that, I had to quit some RPG sessions and deny new ones until I figured out my new schedule. At the time denied an RPG that I really wanted, however, I couldn't commit to participating; the planning started in mid-2020, but it didn't work out so the idea was scraped out. After that, in 2022, the pandemic was much more manageable, and everything was getting back to normal, the RPG plan that I wanted to play with my friends was coming back, but they didn't invite me. The Dungeon Master (DM for short) already had a full team (6 people), and was unable to add one more.At the time, I was the jerk because I started harassing the DM to put me in the game, and this started a big fight (if necessary, I will can be specific in an edit), but long story short, all RPG games with my friends were stopped for 6 months because I created a rift between friends, some understood the context of 2020 and they were on my side, others defended the DM because I denied my seat at the time. In the end, the DM and I apologized for eachother and the RPG did not happen. Now, for the problem that is happening: Another RPG started brewing with another DM (I will call her Anna) started planning a Oneshot, she is already a DM in another RPG session (D&D) that I also play, however, she wanted to also DM Exalted (a really complex system). Anna invited me and 4 other friends to play, at the time I said yes. So the next day I started reading the system and was really intimidated,it has 200+ charms, and alot of specifc rules, so I asked one of the players for help, but it didn't help much. Intimidated and confused, I later told Anna that I was vacating my seat; she was upset but didn't argue, later another friend took my seat. My reasoning to gave up my seat was that I wouldn't commit to a really complex system to play only 1-3 sessions, only if it was a campaign I would comit. A few days passed, and I heard from my friends that Anna was thinking about changing the Exated one-shot to a campaign, and she would stop her D&D campaign for it. I didn't tell my friends at the time, but I was really upset, not only would the one-shot become a campaign, but the other campaigns would stop because of it. So, IATA for asking for my playce back in the campaing with the fear of bringing back that rift and maybe losing some friends?",
        "gilded": 0,
        "title": "AITA to ask to join an RPG game after denying my spot the first time.",
        "upvote_ratio": 0.64,
        "ups": 3,
        "link_flair_text": "Asshole",
        "created": 1738848111.0,
        "num_comments": 13,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij2e4p/aita_to_ask_to_join_an_rpg_game_after_denying_my/",
        "num_crossposts": 0
    },
    {
        "selftext": "Ok, before the comments roll in, yes, I could be the a**hole, bit I wanna give you guys some details. I (15M) had joined freshmen football for high school. We had 8-2, better than JV and Varsity had this year. We had spent all of our Sumner practicing and grinding every day until the season started. Well, one day in practice (in the middle of July) after warm-ups, I had given a suggestion to our Coach about how the defense needs to work on their hand movement and the way they should go when the ball is snapped. BTW, our defense sucked this summer.....i was on defense😑. And, he looked at me, like he's my dad when I did something stupid, and I said, What? He said.Well, can't it wait?! Half of the people were on my side, and half were on the coach's. I still continued, and all I said that made him really mad was, Maybe if you weren't so soft on us, then Defense would've sucked right now. And I wanna add one more person, he's another coach, he had served time in the military, and as soon as he heard me what I said , he said All, right. Since yall were soft, LEMME MAN YOU THE F*CK UP! And made all of us run nonstop until practice is over. If we slow down, it is more minutes, walking and talking, more minutes. Luckily, we finished before I had a heart attack, and everyone knew not to give coach obvious facts to anger or punish us like that ever again. AITA? Edit 2/5/25: Okay, yes, ITA, but if yall wanna know if my team hated me or not, no, they didn't hate me, they didn't clown on my ass, we just simply laughed it off and that was that.",
        "gilded": 0,
        "title": "AITA For making my friends run a lot in Football practice one day for an Opinion?",
        "upvote_ratio": 0.73,
        "ups": 5,
        "link_flair_text": "Asshole",
        "created": 1738719994.0,
        "num_comments": 13,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ihyseb/aita_for_making_my_friends_run_a_lot_in_football/",
        "num_crossposts": 1
    },
    {
        "selftext": "I'll try to be as fair as I possibly can to my friend about this. She's mad at me because I basically forced her to admit that she needs to be alone. I'm entirely *okay* with her needing to be alone but she refused to actually admit that or communicate with me until I basically said, either tell me what's fucking going on or take the space you so clearly need already. This started basically two weeks ago. My friend shut down without telling me what was going on. I still don't know the entire story of why she did tbh. Then, about a week ago she said she was ready to talk again and explained a little about how why she shut down but not the whole reason. She said she was ready to talk again but she *very* clearly wasn't. I kept telling her that if she needed more space I genuinely did not care and would give her that, she didn't say she did.  Then these past few days she started replying to the first few messages I'd send then ignoring me entirely the rest of the day. Again I said if she needed space to tell me that. She didn't. This morning she said she's trying to distance herself from everyone and that she's used to being alone almost all the time. Finally it came to a head just a few minutes ago and I called her out. I basically laid it out for her, I said either tell me what's going on and let's settle this or take your space already but stop pretending like there's nothing wrong.  Keep in mind. This is a friend I'd been talking to pretty much 24/7 for the past two to three months. We'd gotten really, REALLY close, she told me things very few people in her life know. I think I have a right to say something, to be worried when she basically disappears on me, comes back, but then *everything* is different than it was before and she essentially says she has no plans of things going back to how they were beforehand. AITA here?  Edit: I sent her this message because I realized pretty quickly that yeah I'm the asshole here, I promise I'm not going to send anything after this but I need to apologize. I've been spamming you with messages, not respecting your boundaries, and, simply put not ACTUALLY listening to what you've been telling me this whole time even if you didn't directly say it. I don't know that I can claim to actually care about you after doing all that. I'll leave you alone now for a while. I hope we can reconnect and fix things eventually but if not I understand ",
        "gilded": 0,
        "title": "AITA for forcing my friend to admit she needs space",
        "upvote_ratio": 0.55,
        "ups": 1,
        "link_flair_text": "Asshole",
        "created": 1738621155.0,
        "num_comments": 12,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ih1tm7/aita_for_forcing_my_friend_to_admit_she_needs/",
        "num_crossposts": 2
    },
    {
        "selftext": "Once I asked a friend to help me move and they said yes because they are compassionate and helpful. I told them I'd buy a pizza. I had already hired 2 guys and a truck to do the heavy lifting, just needed some extra hands. Then one of the guys quit while we were still packing up boxes with stuff. So i asked my friend if they could fill in and they said yes because they saw I was in need and they are compassionate and helpful. I offered to buy my friend some additional pizza.  After a few hours of heavy lifting (I assume, I had to pop out for a bit for band rehearsal) my friend asked if I could pay them what I was going to give to the guy who quit.  Unfortunately, I already gave that guy money, so I could only pay my friend about half that. Then the other guy with the truck quit and I told my friend just to cover for them until I found a new guy.  I told my friend I couldn't give them any additional money for helping, but I would pay them $1 for each box. They said ok because it wasn't really about the money, it was about helping.After we got the truck loaded, I paid them $1 for every box... after the first 100 boxes. I forgot to tell them that part. The lock on the truck was broken and I didn't want to pay to fix it, so I told my friend to sleep in the truck to keep it safe while we parked it on the Chicago streets until we could unload it in a couple days. They said ok, because they knew no one else would do it and they wanted to keep the boxes safe. When it was time to unload the truck, I had to let her get a head start without me (I had band practice again). They were responsible for bringing boxes up the stairs while I was responsible for telling them which room to put them in (though admittedly I did get distracted a few times, phones right?). Once we got it all unloaded, my friend was helping me unpack because they saw I needed the extra hands. I opened the box marked kitchen and discovered that one of my mugs wasn't in the kitchen box.  I asked my friend where the mug was. They said they weren't sure, maybe it was just forgotten in all the confusion and they could go back to the house to check or look in another box.  I fired them immediately and began telling their friends and coworkers, I don't know for sure that they didn't steal the mug.  So, am I the a-hole? Which is more likely- that my friend did all that work and still stole a mug? or that I gave them an impossible task without supporting her and one item in a sea of items was temporarily misplaced?",
        "gilded": 0,
        "title": "AITA for asking my friend to help me move then firing them before it's over?",
        "upvote_ratio": 0.14,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738590613.0,
        "num_comments": 12,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igphk0/aita_for_asking_my_friend_to_help_me_move_then/",
        "num_crossposts": 1
    },
    {
        "selftext": "AITA for cancelling on my friend AGAIN? So me (18f) and my friend (19m) have been friends for a good year now and we met at uni kind of cause our friend groups collided. We have been good friends but our communication is pretty ass on both of our parts.  Now we made plans to hang out at new years at his place, which for me is a good two hour trip and not that I mind the distance but I couldn’t sleep over there cause his roommate would have friends over and they wouldn’t have any space for me. And we couldnt spend it at mine since i would still be moving in and have nothing but a single person mattress and a lot of bags and boxes to get around. We planned this like a week ahead and I did say I might have to cancel later on while planning cause of my dad being in the hospital with a broken thumb and a harsh infection on the stitches. I also told him about my worry for the distance I’d have to travel that late at night, but said I’d let him know about it. Which I did four days prior that I wouldn’t be able to make it due to the reasons I gave him before. I told him I was sorry and that I’d make up for it soon. But all he did was sigh loudly and said “okay, yeah sure.” And before I could say anything else he hung up. He ghosted me for like a week and didnt even show up to the place where our friends meet up for a week and a half. Then he showed up like nothing happened until he asked to talk to me alone and continued to talk about how it was a asshole move to cancel on him like that and acted like I betrayed him last second.  Now I apologized again in that moment and then he said it’s fine and that we could go back to being friends like we stopped because I cancelled.  So a few weeks ago, he invited me to go to this vintage market after college. To which I kind of said the same thing about having to see cause I was a little busy and starting a new therapy trial and could be tired at that time. That day came and I went home early after puking on an empty stomach and he called me the moment I was gonna text him and I told him first thing and he didn’t even say anything before hanging up and ghosting me again and he hasn’t texted me since. I haven’t been at college since then and I follow my classes online cause I’m still incredibly sick and I haven’t been able to leave my house or move too much at all.  I’ve been feeling guilty about it the entire time and I’ve tried to apologize a lot of times through text but he just keeps ignoring me. I feel really shitty about cancelling him a bunch of times and I really don’t know if it’s my fault or not?  So AITA?",
        "gilded": 0,
        "title": "AITA for cancelling on my friend twice?",
        "upvote_ratio": 0.38,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738578877.0,
        "num_comments": 12,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igm7os/aita_for_cancelling_on_my_friend_twice/",
        "num_crossposts": 1
    },
    {
        "selftext": "To make this quick and simple I, 22M, and my girlfriend, 23F, have a disagreement that can heavily affect my family in the process. Simply put, we are in housing with my mother and sister but my girlfriend and mother get along about as well as two male betta fish in a drinking cup (only verbally ofc). Mother informs of a program that let's us build home with other people and eventually that house is given to the members who built it, that way we can still be together as my culture often does. But instead of doing the program to have a house free from strick rules of housing, my girlfriend would rather that we, only her and I, do the project and leave into the new house once done, letting my mother and little sister stay here in housing. Either option leads to consequences I don't like so I ask that if I do as my girlfriend says, WIBTA?",
        "gilded": 0,
        "title": "WIBTA for not taking my family with me?",
        "upvote_ratio": 0.83,
        "ups": 11,
        "link_flair_text": "Asshole",
        "created": 1738829383.0,
        "num_comments": 9,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iixnv2/wibta_for_not_taking_my_family_with_me/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (21F) had a fight with my friend (22F) about a picture I had on my IG story highlights.This was a picture of my high school friend group + some college friends (her included), and I posted it in October of last year. The thing is, my friend saw it (way deep into other old stories) and shared it with me, saying: “I look really fat, like a pig. Delete it.” She always says something along those lines, even though she’s nowhere near fat, and in that picture she looked normal. Had she looked ugly I would’ve deleted it no questions asked, but it was a cute picture with other friends that I don’t even see that much. It was a fun memory. So we fought, her saying she looked bad, me saying no one looks at my stories anyway (I have few followers), and most importantly, deleting it felt like accepting her delusion and harmful comments about her body. She then threatened to share ugly photos of me (that I honestly don’t care about) and report the story. I said go ahead. Anyway, after a long fight, I gave in. I know that her high school friends were obsessed with being skinny and laughed at fat girls (what the fuck), so I know it’s a sensitive issue for her (even though she doesn’t realize it). I deleted the story, but I still think I shouldn’t have. Am I the asshole? ",
        "gilded": 0,
        "title": "AITA for not deleting an IG story?",
        "upvote_ratio": 0.46,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738476703.0,
        "num_comments": 11,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ifqwbv/aita_for_not_deleting_an_ig_story/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (M27) work in the hospitality industry. I've been at my actual company there for 2 years and I have made different friendships along the way, including a group of friends.  In this group there are 2 people which I will call Laura (F) & Paul (M). They are both in their early thirties. I have been very close to them. My relationship with Laura is based on a lot of compassion, laughter & we are basically telling each other almost everything, she helped a lot at the beginning when I started and she believes in me.  With Paul the relationship I would say have been a bit toxic but good, as I was always afraid of how he would react, he would give me a lot of advices based solely on his pov. He never really tried to understand me as a whole (I struggle with mental health), a lot of tough love I would say.  Early December we have decided to buy a common gift for a birthday. Laura has bought a gift. Everyone gave the money, except for Paul . When she confronted him, he stated that he's been really struggling financially & big family issues. She tried to understand but for her it was not a valid reason and he should have tried to communicate instead of ignoring her. Paul owes me a significant amount of money too. Paul has been ignoring my texts for 2 weeks and being very avoidant at work. He finally replied and I was shocked. He stated that I should have said something to her and basically I am bad friend for not taking his side and he was more there for me than her (which is not true) & he's taking his distances from everyone as our establishment will close in 2 months.  I told him I didn't want to be in the middle of this (I have a past with this), you are both my friends and I simply can not choose. He is forgetting that I have helped him in the past, I was there for him. He didn't understand he chooses to stop talking & unfollowed me on social media. I don't think I will see my money ever again.  Laura has been very supportive, understood I will not take sides and our relationship has not changed.  I have lost a friend, but AITA for not taking the side & being more supportive ? Thank you for reading.  Edit: names for clarity",
        "gilded": 0,
        "title": "AITA for not taking sides between 2 close friends at work?",
        "upvote_ratio": 0.75,
        "ups": 2,
        "link_flair_text": "Asshole",
        "created": 1738325016.0,
        "num_comments": 11,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ied8u4/aita_for_not_taking_sides_between_2_close_friends/",
        "num_crossposts": 0
    },
    {
        "selftext": "English is not my first so language. So, I've been feeling down for a while and have not been able to pull my weight in our household.. so last night I pulled myself together and did my best to clean the floors downstairs since she was complaining she wouldn't get it done...I know this was due to my lack of action, I'm probably the jerk there, which is why I wanted to give her a worryfree weekend and do the floors for her.. I could only do the floors tho, no dusting or whatever... it's not even dusty since I did it last week..I even told her I would do them next week (I leave tomorrow for the weekend) My mom came back from school an immediately began pointing out what hadn't been done and said nothing about what I did do until I pointed  it out. This isn't the issue,the issue is that I woke up to use the bathroom and have to walk by her room, apparently she was awake and called me over. She started by saying how it bothered her that I cleaned the floors and it kept her up all night. I know how she is and this is usually how fights start, so it being 6am I was quite agitated as I was not in the mood for this so early in the morning. Anyway, she told me she does not appreciate what I've done, that this was not what we agreed upon, why didn't I do the surfaces like I was told, why did I clean the floors, now she's stuck spending the weekend dusting and so on and so forth. At this point I exploded because for the 100th time, it's obvious she doesn't listen to the words coming out of my mouth. I told her I was not doing this at 6 am, that I wanted to go back to bed before my alarm went off. Her answer? Then my day is ruined and I'll have to cancel everything because I can't sleep like this..  At this point I exploded and I might've evolved into the jerk.. I called (screamed) her manipulative and that I am not doing this so early in the morning. That I was digusted that she would be acting like this over me trying to do something nice for her. She told me I didn't do it for her, I did it for myself to manipulate HER and what was she supposed to do this weekend? Guys, I was honestly flabbergasted.... I was like anything you want?!  Apparently, she can't do anything she wants now because I manipulated her by doing what I want and now she has to dust and clean the surfaces... I.TOLD.HER.TWICE.AT.THIS.POINT. that I would do them.  The conversation was going nowhere and I didn't want the cops called on us for our screaming match this early in the morning, so I cut the conversation short and removed myself from the situation, which..made her even more mad but at this point I didn't even care, I was hurt and angry. Back to my room I went. I just.. I'm at a loss..am I really such a manipulative monster for what I did? Am I in the wrong? Was my thinking off? Should I have just done the stupid dusting? It may sound stupid, I know it does... So here I am..",
        "gilded": 0,
        "title": "AITA for trying to do something nice for my mother and exploding when she doesn't appreciate it?",
        "upvote_ratio": 0.6,
        "ups": 2,
        "link_flair_text": "Asshole",
        "created": 1738303955.0,
        "num_comments": 11,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ie8h7p/aita_for_trying_to_do_something_nice_for_my/",
        "num_crossposts": 0
    },
    {
        "selftext": "For some context, this happened in the friends gc. I (18F) my friends; R(18F), L(18F), S(18F), J(19F) and M(18F). We all went to the same highschool. So about a day ago R had told us in the gc that S was going out with a guy that was interested in her. This guy Z(20M) had liked S for a long time, but I still felt weird about him. There was a rumor not too long ago that really made everyone in the gc dislike him but we found out that of course the rumors were fake. Still I felt weird about him. S had been talking to Z for a long time and says that his a genuine, nice, kind guy. Z had been asking S out to get to know her better and to finally talk to her in person but S would refuse but then finally she gave in. He even stated that if she felt uncomfortable seeing him by herself that she could come someone, which is what S did. They're probably on the that date right now as I am writing this. So when R told us in the gc that S was going out with Z of course people in the gc didn't see an issue since S had clarified time and time again that Z was not a bad person. Still as I said I still felt weird about him. I have a lot of trust issues with men since I've seen a lot of trashy men with the women around me. So I voiced my concern, I didn't know that this would turn into a whole agreement in the gc about marriage.  L and R were the one's that were going at it, I'd chip in here and there giving my two cents on the agreement but the argument ended, or so I thought. This morning the argument resurfaced again since L had told said, (my name) is hater of men so S don't listen to her My friends already know how I feel about men and this is a joke in the gc so I didn't take it the wrong way. We started joking once again me, R and L in the GC I had said, before you girls go looking for a husband or man with nothing to your name go look for money first I really just said this as a joke not think someone would get offensed to this. I left the gc after saying this since I have things to do around the house after a few hours I come back to the GC to see an argument between R and L. R was saying that before you get married it's better to be financially stable, L was saying that you just need to find a good man and saying that getting married doesn't mean one needs to stop improving themselves. After a while they found out that they were arguing about the same thing but just from different perspectives.  R asked L why they're even arguing to which L proceeded to reply to my previous comment about looking for money instead of getting married. She said it seemed that I had an inferiority complex to which R replied asking how. L proceed to say that it must have rubbed her the wrong way and the conversation ended there. I didn't want to say anything in the GC so I texted L privately asking her how my comment rubbed her the wrong way and how she felt. She is yet to reply to me and when she does I'll update you. But from this AITA?",
        "gilded": 0,
        "title": "AITA for being mean",
        "upvote_ratio": 0.29,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738321226.0,
        "num_comments": 10,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iecaf8/aita_for_being_mean/",
        "num_crossposts": 1
    },
    {
        "selftext": "Hello!  I (29, M) had an argument with my partner (29, M) over my decision to bail out of my partner's friend's wedding. Some background:I have a pretty bad social anxiety. I'm also not fully out of the closet and struggle with internalise homophobia (I'm not out to my family). I have not been fully comfortable with attending social events with my partner (weddings, parties etc.) as a couple because of my issues. I have made a few attempts but they did not go very well usually (I ended up feeling drained and stressed out). Recently we have been invited to my partner's friend's wedding (I don't know them well at all). He insisted it's important for him that I attend. I understood that and agreed. Recently, however a wedding of my cousin came up, which is actually on the same date as the other wedding. I am not that close to my cousin, but as everyone I am close with will be there, I think it's important for me to attend. Also, my parents made it clear that I should attend. I also live in a different country so I don't see them that often. I think that it is reasonable for me to attend the wedding of my cousin since it is my family instead of some other person's that I do not know well even though they're a friend of my partner. My parents of course do not know I have a partner, therefore I cannot say that I have that other wedding. My partner insisted that I lie to them and say that I am ill or already have a holiday booked, but I don't feel it's right (even though I needed to lie to them on some other occasions). To be honest, even if my parents knew about the situation, I still think it is reasonable for me to attend a wedding that is important for me and to spend some time with my family (and would actually be a bit weird the other way). Now, we had a big fight with my partner over this (the biggest so far). He is saying I broke a promise for an unspecified reason and that he does not want to attend the event on his own again. I however feel that because this is actually not because of my social anxiety or my internalised homophobia that I am not going with him, he is slightly overreacting. He says I do not care about his feelings, which is not true. I simply need to make a choice and this on its own is uncomfortable for me. AITA?",
        "gilded": 0,
        "title": "AITA for going to my cousin's wedding instead of my partner's friend's",
        "upvote_ratio": 0.6,
        "ups": 1,
        "link_flair_text": "Asshole",
        "created": 1738854604.0,
        "num_comments": 8,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ij4pfv/aita_for_going_to_my_cousins_wedding_instead_of/",
        "num_crossposts": 0
    },
    {
        "selftext": "(Fixed for the people with no reading comprehension.) This is just regular teenage drama, but today I was talking with my friends. Let's call them Beck, Tanny, Hazel, and Abs. I was talking to Abs and Beck, recently Beck and Hazel have been having drama over a boy (of course) and Hazel has been dragging it for months now, Beck and I were talking about how Hazel kept dragging it and about what Abs told us about what Hazel has said about Beck. Now it wasn't good stuff, Hazel was saying Beck was a bad person and that she was a slut.  Beck and I decided to make a group chat with Abs to all talk about it and Beck decided to confront Hazel, Hazel claimed she knew nothing about it even though both me and Abs have heard her say it. After that was over me and Abs agreed to texted Hazel and say we didn't want to be friends her anymore. Since Hazel was the type of person to talk crap about people Abs and I assumed there was stuff about us too. We both texted Hazel and explained. My reasoning was that Hazel kept dragging us into unnecessary drama and that I was worried she was talking crap about us, there was also the fact that Hazel was extremely open about her sexual life with her boyfriend (keep in mind we are ALL minors). She got upset claiming she has never talked shit, then heres were Tanny comes in.  Hazel brings Tanny into the conversation and Tanny starts arguing saying that Hazel never talked shit and that we had no proof of any of our claims, even though Hazel is extremely public about her gossip and personal life. Tanny then started posting about us publicly. Not only that but she then started sending Beck threats to hurt her. Me being tired of the harassment, I decided to just block them. Now that I think about it, I don't really feel bad at all. But theres still the fact it sort of seems that it was me who escalated the situation because it was my idea in the first place to message Hazel and tell her I didn't want to be friends.  I personally think my reasoning was valid because no child should be having sex nor causing unnecessary fights and drama over small things, but I want to know if this makes me the bad guy in this situation. I knew she was struggling with mental health, I knew she had trouble with her parents, and I knew this would affect her, but I still did it. Am I the asshole for this situation escalating and affecting someone, or was I in the right to unfriend her? I'm most likely the asshole in this situation, but I just made this so me and my friends could turn it into one of those Minecraft AI YouTube shorts videos. Thanks for reading!",
        "gilded": 0,
        "title": "AITA for this teenage drama?",
        "upvote_ratio": 0.44,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738802803.0,
        "num_comments": 7,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1iipxb0/aita_for_this_teenage_drama/",
        "num_crossposts": 1
    },
    {
        "selftext": "AITA for poking fun at my friend? So me f14 and my other friend, (lets call her hailey) are sleeping over at my house  f14 are on a call with our friend (lets call him john m14) and hes talking about his voice and stuff and me and my friend are kinda like “yeah i mean u just kinda sound like ur age like a normal 14 yr old boy whos voice is like still in the process of changing” and we also have this other friend, (lets call him jake m16) who has a deep voice and john is like “i think i sound like jake” and me and my friend look at eachother and BURST out laughing and john is also like a new edition to our group but before he came like we would always make these jokes and like friendly bantering each other and so me and hailey are like laughing and i like thought he was joking so im like “ok ok like be serious do u actually think u sound like jake?” and johns like “yeah i think we sound similar” and me and hailey start bursting out laughing again and kind of like fucking with him so then hes kinda like “blah blah fuck u” and wed be like “wait was that john or jake?” like teasing him and shit but then he leaves the call and groupchat and we find out hes actually mad and also keep in mind he has a really short temper and me and hailey are like “wait did we take it to far” so were like kinda asking for others opinions and we tell jake what happened and jake is like “yeah john is kind of just going thru puberty and had a fragile masculinity i was like that at his age hell grow out of it” so hailey and i are just wondering if we were going too far.",
        "gilded": 0,
        "title": "AITA for poking fun at my friend",
        "upvote_ratio": 0.46,
        "ups": 0,
        "link_flair_text": "Asshole",
        "created": 1738530446.0,
        "num_comments": 7,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ig7qfc/aita_for_poking_fun_at_my_friend/",
        "num_crossposts": 2
    },
    {
        "selftext": "Long story short. A friend of mine is going through some tough times and a lot of people are curious about what’s going on. I know, but I’m not telling anyone. I’ve been peppered with questions trying to get me to open up and spill the tea. I’m uncomfortable with the questions so I just said “ahh they’re probably mad at me for something” (wasn’t true) The person I said this too ran to my friend and told them. I was called out by my friend and told to not make any comments about them, that they’re dealing with a lot and don’t need this. Now I’m the a-hole but just wanted to protect them",
        "gilded": 0,
        "title": "AITA for protecting a friend?",
        "upvote_ratio": 1.0,
        "ups": 3,
        "link_flair_text": "Asshole",
        "created": 1738726147.0,
        "num_comments": 6,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ii0uih/aita_for_protecting_a_friend/",
        "num_crossposts": 1
    },
    {
        "selftext": "I (26 F) was cast in a paid fandub production back in the fall of 2019. However the project hasn't gone anywhere; there are only three people in the Discord server including myself and I've kept asking for updates every so often for the past five years, but I almost never get an answer. I'm tired of constantly being left in the dark. I've had a bad streak with voice acting projects; the ones I'm cast in almost never go through and the only reason one has gone through is that someone picked it up as co-director after the original one hadn't responded for months. But back to the paid one; this is my only paid role I've been cast in so far. And it just hasn't gone anywhere and I feel like I'm SO close to crashing out on someone. I want so badly to go off on them, but I'm worried about how this could impact me for future directors. I figured that I should get some input before making a decision, and so I wanna know; WIBTA if I did?",
        "gilded": 0,
        "title": "WIBTA for going off on the director of a voice acting project and then possibly leaving said project?",
        "upvote_ratio": 0.75,
        "ups": 2,
        "link_flair_text": "Asshole",
        "created": 1738562320.0,
        "num_comments": 6,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1igifce/wibta_for_going_off_on_the_director_of_a_voice/",
        "num_crossposts": 1
    }
]